[
    {
        "id": 301,
        "content": "An EC2 instance is connected to an ENI (Elastic Network Interface) in one subnet. What happens when you attach an ENI of a different subnet to this EC2 instance?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "The EC2 instance follows the rules of the older subnet.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The EC2 instance follows the rules of both the subnets.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Not possible, cannot be connected to 2 ENIs.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The EC2 instance follows the rules of the newer subnet.",
                "correct": false
            }
        ]
    },
    {
        "id": 302,
        "content": "You have deployed a three-tier web application in a VPC with a CIDR block of 10.0.0.0/28. You initially deploy two web servers, two application servers, two database servers and one NAT instance for a total of seven EC2 instances. The web, application and database servers are deployed across two Availability Zones (AZs). You also deploy an ELB in front of the two web servers, and use Route 53 for DNS. Web traffic gradually increases in the first few days following the deployment, so you attempt to double the number of instances in each tier of the application to handle the new load. Unfortunately some of these new instances fail to launch. Which of the following could be the root cause? (Choose 2 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "AWS reserves the first and the last private IP address in each subnet's CIDR block so you do not have enough addresses left to launch all of the new EC2 instances.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Internet Gateway (IGW) of your VPC has scaled-up, adding more instances to handle the traffic spike, reducing the number of available private IP addresses for new instance launches.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The ELB has scaled-up, adding more instances to handle the traffic spike, reducing the number of available private IP addresses for new instance launches.",
                "correct": true
            },
            {
                "id": 4,
                "content": "AWS reserves one IP address in each subnet's CIDR block for Route 53 so you do not have enough addresses left to launch all of the new EC2 instances.",
                "correct": false
            },
            {
                "id": 5,
                "content": "AWS reserves the first four and the last IP address in each subnet's CIDR block so you do not have enough addresses left to launch all of the new EC2 instances.",
                "correct": true
            }
        ]
    },
    {
        "id": 303,
        "content": "Which of the following will cause an immediate DB instance reboot to occur?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "You change storage type from standard to PIOPS, and Apply Immediately is set to true.",
                "correct": true
            },
            {
                "id": 2,
                "content": "You change the DB instance class, and Apply Immediately is set to false.",
                "correct": false
            },
            {
                "id": 3,
                "content": "You change a static parameter in a DB parameter group.",
                "correct": false
            },
            {
                "id": 4,
                "content": "You change the backup retention period for a DB instance from 0 to a nonzero value or from a nonzero value to 0, and Apply Immediately is set to false.",
                "correct": false
            }
        ]
    },
    {
        "id": 304,
        "content": "EBS Snapshots occur [...].",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Asynchronously.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Synchronously.",
                "correct": false
            }
        ]
    },
    {
        "id": 305,
        "content": "You are tasked with moving a legacy application from a virtual machine running Inside your datacenter to an Amazon VPC Unfortunately this app requires access to a number of on-premises services and no one who configured the app still works for your company. Even worse there's no documentation for it. What will allow the application running inside the VPC to reach back and access its internal dependencies without being reconfigured? (Choose 3 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "An AWS Direct Connect link between the VPC and the network housing the internal services.",
                "correct": true
            },
            {
                "id": 2,
                "content": "An Internet Gateway to allow a VPN connection.",
                "correct": false
            },
            {
                "id": 3,
                "content": "An Elastic IP address on the VPC instance.",
                "correct": false
            },
            {
                "id": 4,
                "content": "An IP address space that does not conflict with the one on-premises.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Entries in Amazon Route 53 that allow the Instance to resolve its dependencies' IP addresses.",
                "correct": false
            },
            {
                "id": 6,
                "content": "A VM Import of the current virtual machine.",
                "correct": true
            }
        ]
    },
    {
        "id": 306,
        "content": "A company needs to deploy services to an AWS region which they have not previously used. The company currently has an AWS identity and Access Management (IAM) role for the Amazon EC2 instances, which permits the instance to have access to Amazon DynamoDB. The company wants their EC2 instances in the new region to have the same privileges. How should the company achieve this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Create a new IAM role and associated policies within the new region.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Assign the existing IAM role to the Amazon EC2 instances in the new region.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Copy the IAM role and associated policies to the new region and attach it to the instances.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Create an Amazon Machine Image (AMI) of the instance and copy it to the desired region using the AMI Copy feature.",
                "correct": false
            }
        ]
    },
    {
        "id": 307,
        "content": "If you want to launch Amazon Elastic Compute Cloud (EC2) instances and assign each instance a predetermined private IP address you should:",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Launch the instance from a private Amazon Machine Image (AMI).",
                "correct": false
            },
            {
                "id": 2,
                "content": "Assign a group of sequential Elastic IP address to the instances.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Launch the instances in the Amazon Virtual Private Cloud (VPC).",
                "correct": false
            },
            {
                "id": 4,
                "content": "Launch the instances in a Placement Group.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Use standard EC2 instances since each instance gets a private Domain Name Service (DNS) already.",
                "correct": false
            }
        ]
    },
    {
        "id": 308,
        "content": "When automatic failover occurs, Amazon RDS will emit a DB Instance event to inform you that automatic failover occurred. You can use the [...] to return information about events related to your DB Instance.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "FetchFailure.",
                "correct": false
            },
            {
                "id": 2,
                "content": "DescriveFailure.",
                "correct": false
            },
            {
                "id": 3,
                "content": "DescribeEvents.",
                "correct": true
            },
            {
                "id": 4,
                "content": "FetchEvents.",
                "correct": false
            }
        ]
    },
    {
        "id": 309,
        "content": "You have a Business support plan with AWS. One of your EC2 instances is running Microsoft Windows Server 2008 R2 and you are having problems with the software. Can you receive support from AWS for this software?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Yes.",
                "correct": true
            },
            {
                "id": 2,
                "content": "No, AWS does not support any third-party software.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No, Microsoft Windows Server 2008 R2 is not supported.",
                "correct": false
            },
            {
                "id": 4,
                "content": "No, you need to be on the enterprise support plan.",
                "correct": false
            }
        ]
    },
    {
        "id": 310,
        "content": "A newspaper organization has a on-premises application which allows the public to search its back catalogue and retrieve individual newspaper pages via a website written in Java They have scanned the old newspapers into JPEGs (approx 17TB) and used Optical Character Recognition (OCR) to populate a commercial search product. The hosting platform and software are now end of life and the organization wants to migrate Its archive to AWS and produce a cost efficient architecture and still be designed for availability and durability. Which is the most appropriate?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS offers various cost optimization options including Reserved Instances, Spot Instances, and lifecycle policies.",
        "answers": [
            {
                "id": 1,
                "content": "Use S3 with reduced redundancy to store and serve the scanned files, install the commercial search application on EC2 Instances and configure with auto-scaling and an Elastic Load Balancer.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Model the environment using CloudFormation use an EC2 instance running Apache webserver and an open source search application, stripe multiple standard EB5 volumes together to store the JPEGs and search index.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Use S3 with standard redundancy to store and serve the scanned files, use Cloud5earch for query processing, and use Elastic Beanstalk to host the website across multiple Availability Zones.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Use a single-AZ RD5 My5QL instance to store the search index 33d the JPEG images use an EC2 instance to serve the website and translate user queries into 5Q",
                "correct": false
            },
            {
                "id": 5,
                "content": "Use a CloudFront download distribution to serve the JPEGs to the end users and Install the current commercial search product, along with a Java Container Tor the website on EC2 instances and use Route 53 with DNS round-robin.",
                "correct": false
            }
        ]
    },
    {
        "id": 311,
        "content": "A Provisioned IOPS volume must be at least [...] GB in size.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "1.",
                "correct": false
            },
            {
                "id": 2,
                "content": "50.",
                "correct": false
            },
            {
                "id": 3,
                "content": "20.",
                "correct": false
            },
            {
                "id": 4,
                "content": "10.",
                "correct": true
            }
        ]
    },
    {
        "id": 312,
        "content": "In Amazon EC2, while sharing an Amazon EBS snapshot, can the snapshots with AWS Marketplace product codes be public?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Yes, but only for US-based providers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes, they can be public.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No, they cannot be made public.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Yes, they are automatically made public by the system.",
                "correct": false
            }
        ]
    },
    {
        "id": 313,
        "content": "A company has an AWS account that contains three VPCs (Dev, Test, and Prod) in the same region. Test is peered to both Prod and Dev. All VPCs have non-overlapping CIDR blocks. The company wants to push minor code releases from Dev to Prod to speed up time to market. Which of the following options helps the company accomplish this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "Create a new peering connection Between Prod and Dev along with appropriate routes.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Create a new entry to Prod in the Dev route table using the peering connection as the target.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Attach a second gateway to Dev. Add a new entry in the Prod route table identifying the gateway as the target.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The VPCs have non-overlapping Cl DR blocks in the same account. The route tables contain local routes for all VPCs.",
                "correct": true
            }
        ]
    },
    {
        "id": 314,
        "content": "The [...] service is targeted at organizations with multiple users or systems that use AWS products such as Amazon EC2, Amazon SimpleDB, and the AWS Management Console.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Amazon RDS.",
                "correct": false
            },
            {
                "id": 2,
                "content": "AWS Integrity Management.",
                "correct": false
            },
            {
                "id": 3,
                "content": "AWS Identity and Access Management.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Amazon EMR.",
                "correct": false
            }
        ]
    },
    {
        "id": 315,
        "content": "You have just been given a scope for a new client who has an enormous amount of data (petabytes) that he constantly needs analysed. Currently he is paying a huge amount of money for a data warehousing company to do this for him and is wondering if AWS can provide a cheaper solution. Do you think AWS has a solution for this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Yes. Amazon SimpleDB.",
                "correct": false
            },
            {
                "id": 2,
                "content": "No. Not presently.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Yes. Amazon Redshift.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Yes. Your choice of relational AMIs on Amazon EC2 and EBS.",
                "correct": false
            }
        ]
    },
    {
        "id": 316,
        "content": "You have set up an Elastic Load Balancer (ELB) with the usual default settings, which route each request independently to the application instance with the smallest load. However, someone has asked you to bind a user's session to a specific application instance so as to ensure that all requests coming from the user during the session will be sent to the same application instance. AWS has a feature to do this. What is it called?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Elastic Load Balancing automatically distributes incoming application traffic across multiple targets.",
        "answers": [
            {
                "id": 1,
                "content": "Connection draining.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Proxy protocol.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Tagging.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Sticky session.",
                "correct": true
            }
        ]
    },
    {
        "id": 317,
        "content": "You have written a CloudFormation template that creates 1 Elastic Load Balancer fronting 2 EC2 Instances. Which section of the template should you edit so that the DNS of the load balancer is returned upon creation of the stack?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Resources.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Outputs.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Parameters.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Mappings.",
                "correct": false
            }
        ]
    },
    {
        "id": 318,
        "content": "AWS CloudFormation is a service that helps you model and set up your Amazon Web Services resources so that you can spend less time managing those resources and more time focusing on your applications that run in AWS. You create a template that describes all the AWS resources that you want (like Amazon EC2 instances or Amazon RDS DB instances), and AWS CloudFormation takes care of provisioning and configuring those resources for you. What formatting is required for this template?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "JSON-formatted document.",
                "correct": true
            },
            {
                "id": 2,
                "content": "CSS-formatted document.",
                "correct": false
            },
            {
                "id": 3,
                "content": "XML-formatted document.",
                "correct": false
            },
            {
                "id": 4,
                "content": "HTML-formatted document.",
                "correct": false
            }
        ]
    },
    {
        "id": 319,
        "content": "A user has created an application which will be hosted on EC2. The application makes calls to DynamoDB to fetch certain data. The application is using the DynamoDB SDK to connect with from theEC2 instance. Which of the below mentioned statements is true with respect to the best practice for security in this scenario?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "The user should create an IAM user with DynamoDB access and use its credentials within the application to connect with DynamoDB.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The user should attach an IAM role with DynamoDB access to the EC2 instance.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The user should create an IAM role, which has EC2 access so that it will allow deploying the application.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The user should create an IAM user with DynamoDB and EC2 access. Attach the user with the application so that it does not use the root account credentials.",
                "correct": false
            }
        ]
    },
    {
        "id": 320,
        "content": "After setting up an EC2 security group with a cluster of 20 EC2 instances, you find an error in the security group settings. You quickly make changes to the security group settings. When will the changes to the settings be effective?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "The settings will be effective immediately for all the instances in the security group.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The settings will be effective only when all the instances are restarted.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The settings will be effective for all the instances only after 30 minutes.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The settings will be effective only for the new instances added to the security group.",
                "correct": false
            }
        ]
    },
    {
        "id": 321,
        "content": "Can a user get a notification of each instance start / terminate configured with Auto Scaling?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Auto Scaling helps maintain application availability and allows you to scale your applications automatically.",
        "answers": [
            {
                "id": 1,
                "content": "Yes, if configured with the Launch Config.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes, always.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Yes, if configured with the Auto Scaling group.",
                "correct": true
            },
            {
                "id": 4,
                "content": "No.",
                "correct": false
            }
        ]
    },
    {
        "id": 322,
        "content": "Which Amazon storage do you think is the best for my database-style applications that frequently encounter many random reads and writes across the dataset?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "None of these.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Amazon Instance Storage.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Any of these.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Amazon EBS.",
                "correct": true
            }
        ]
    },
    {
        "id": 323,
        "content": "In the Amazon RDS Oracle DB engine, the Database Diagnostic Pack and the Database Tuning Pack are only available with [...].",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "Oracle Standard Edition.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Oracle Express Edition.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Oracle Enterprise Edition.",
                "correct": true
            },
            {
                "id": 4,
                "content": "None of these.",
                "correct": false
            }
        ]
    },
    {
        "id": 324,
        "content": "Will my standby RDS instance be in the same Availability Zone as my primary?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "Only for Oracle RDS types.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Only if configured at launch.",
                "correct": false
            },
            {
                "id": 4,
                "content": "No.",
                "correct": true
            }
        ]
    },
    {
        "id": 325,
        "content": "An administrator is using Amazon CloudFormation to deploy a three tier web application that consists of a web tier and application tier that will utilize Amazon DynamoDB for storage. When creating the CloudFormation template, which of the following would allow the application instance access to the DynamoDB tables without exposing API credentials?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon DynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale.",
        "answers": [
            {
                "id": 1,
                "content": "Create an Identity and Access Management Role that has the required permissions to read and write from the required DynamoDB table and associate the Role to the application instances by referencing an instance profile.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Use the Parameter section in the Cloud Formation template to have the user input Access and Secret Keys from an already created IAM user that has the permissions required to read and write from the required DynamoDB table.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create an Identity and Access Management Role that has the required permissions to read and write from the required DynamoDB table and reference the Role in the instance profile property of the application instance.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Create an identity and Access Management user in the CloudFormation template that has permissions to read and write from the required DynamoDB table, use the GetAtt function to retrieve the Access and secret keys and pass them to the application instance through user-data.",
                "correct": false
            }
        ]
    },
    {
        "id": 326,
        "content": "In an experiment, if the minimum size for an Auto Scaling group is 1 instance, which of the following statements holds true when you terminate the running instance?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Auto Scaling helps maintain application availability and allows you to scale your applications automatically.",
        "answers": [
            {
                "id": 1,
                "content": "Auto Scaling must launch a new instance to replace it.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Auto Scaling will raise an alarm and send a notification to the user for action.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Auto Scaling must configure the schedule activity that terminates the instance after 5 days.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Auto Scaling will terminate the experiment.",
                "correct": false
            }
        ]
    },
    {
        "id": 327,
        "content": "True or False: Manually created DB Snapshots are deleted after the DB Instance is deleted.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 328,
        "content": "Amazon S3 doesn't automatically give a user who creates [...] permission to perform other actions on that bucket or object.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "a file.",
                "correct": false
            },
            {
                "id": 2,
                "content": "a bucket or object.",
                "correct": true
            },
            {
                "id": 3,
                "content": "a bucket or file.",
                "correct": false
            },
            {
                "id": 4,
                "content": "a object or file.",
                "correct": false
            }
        ]
    },
    {
        "id": 329,
        "content": "A company wants to review the security requirements of Glacier. Which of the below mentioned statements is true with respect to the AWS Glacier data security?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides multiple layers of security including network, application, and data protection.",
        "answers": [
            {
                "id": 1,
                "content": "All data stored on Glacier is protected with AES-256 serverside encryption.",
                "correct": true
            },
            {
                "id": 2,
                "content": "All data stored on Glacier is protected with AES-128 serverside encryption.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The user can set the serverside encryption flag to encrypt the data stored on Glacier.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The data stored on Glacier is not encrypted by default.",
                "correct": false
            }
        ]
    },
    {
        "id": 330,
        "content": "What does Amazon EBS stand for?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Elastic Block Storage.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Elastic Business Server.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Elastic Blade Server.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Elastic Block Store.",
                "correct": true
            }
        ]
    },
    {
        "id": 331,
        "content": "You have a distributed application that periodically processes large volumes of data across multiple Amazon EC2 Instances. The application is designed to recover gracefully from Amazon EC2 instance failures. You are required to accomplish this task in the most cost-effective way. Which of the following will meet your requirements?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Spot Instances.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Reserved instances.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Dedicated instances.",
                "correct": false
            },
            {
                "id": 4,
                "content": "On-Demand instances.",
                "correct": false
            }
        ]
    },
    {
        "id": 332,
        "content": "What does Amazon SWF stand for?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Simple Web Flow.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Simple Work Flow.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Simple Wireless Forms.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Simple Web Form.",
                "correct": false
            }
        ]
    },
    {
        "id": 333,
        "content": "Can you specify the security group that you created for a VPC when you launch an instance in EC2-Classic?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "No, you can specify the security group created for EC2-Classic when you launch a VPC instance.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No.",
                "correct": true
            },
            {
                "id": 4,
                "content": "No, you can specify the security group created for EC2-Classic to a non-VPC based instance only.",
                "correct": false
            }
        ]
    },
    {
        "id": 334,
        "content": "Which two methods increases the fault tolerance of the connection to VPC-1? (Choose 2 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "Establish a hardware VPN over the internet between VPC-2 and the on-premises network.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Establish a hardware VPN over the internet between VPC-1 and the on-premises network.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Establish a new AWS Direct Connect connection and private virtual interface in the same region as VPC-2.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Establish a new AWS Direct Connect connection and private virtual interface in a different AWS region than VPC-1.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Establish a new AWS Direct Connect connection and private virtual interface in the same AWS region as VPC-1.",
                "correct": true
            }
        ]
    },
    {
        "id": 335,
        "content": "How would you improve page load times for your users? (Choose 3 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Lower the scale up trigger of your Auto Scaling group to 30% so it scales more aggressively.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Add an Amazon ElastiCache caching layer to your application for storing sessions and frequent DB queries.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Configure Amazon CloudFront dynamic content support to enable caching of re-usable content from your site.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Switch Amazon RDS database to the high memory extra large Instance type.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Set up a second installation in another region, and use the Amazon Route 53 latency-based routing feature to select the right region.",
                "correct": false
            }
        ]
    },
    {
        "id": 336,
        "content": "Typically, you want your application to check whether a request generated an error before you spend any time processing results. The easiest way to find out if an error occurred is to look for an [...] node in the response from the Amazon RDS API.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "incorrect.",
                "correct": false
            },
            {
                "id": 2,
                "content": "error.",
                "correct": true
            }
        ]
    },
    {
        "id": 337,
        "content": "Through which of the following interfaces is AWS Identity and Access Management available? A. AWS Management Console. B. Command line interface (CLI). C. IAM Query API. D. Existing libraries.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS IAM enables you to manage access to AWS services and resources securely.",
        "answers": [
            {
                "id": 1,
                "content": "Only through Command line interface (CLI).",
                "correct": false
            },
            {
                "id": 2,
                "content": "A, B and C.",
                "correct": false
            },
            {
                "id": 3,
                "content": "A and C.",
                "correct": false
            },
            {
                "id": 4,
                "content": "All of the above.",
                "correct": true
            }
        ]
    },
    {
        "id": 338,
        "content": "A [...] is a storage device that moves data in sequences of bytes or bits (blocks).",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "block map.",
                "correct": false
            },
            {
                "id": 2,
                "content": "storage block.",
                "correct": false
            },
            {
                "id": 3,
                "content": "mapping device.",
                "correct": false
            },
            {
                "id": 4,
                "content": "block device.",
                "correct": true
            }
        ]
    },
    {
        "id": 339,
        "content": "You have just finished setting up an advertisement server in which one of the obvious choices for a service was Amazon Elastic MapReduce( EMR) and are now troubleshooting some weird cluster states that you are seeing. Which of the below is not an Amazon EMR cluster state?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "STARTING.",
                "correct": false
            },
            {
                "id": 2,
                "content": "STOPPED.",
                "correct": true
            },
            {
                "id": 3,
                "content": "RUNNING.",
                "correct": false
            },
            {
                "id": 4,
                "content": "WAITING.",
                "correct": false
            }
        ]
    },
    {
        "id": 340,
        "content": "A US-based company is expanding their web presence into Europe. The company wants to extend their AWS infrastructure from Northern Virginia (us-east-1) into the Dublin (eu-west-1) region. Which of the following options would enable an equivalent experience for users on both continents?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Use a public-facing load balancer per region to load-balance web traffic, and enable HTTP health checks.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Use a public-facing load balancer per region to load-balance web traffic, and enable sticky sessions.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Use Amazon Route 53, and apply a geolocation routing policy to distribute traffic across both regions.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Use Amazon Route 53, and apply a weighted routing policy to distribute traffic across both regions.",
                "correct": true
            }
        ]
    },
    {
        "id": 341,
        "content": "You are building infrastructure for a data warehousing solution and an extra request has come through that there will be a lot of business reporting queries running all the time and you are not sure if your current DB instance will be able to handle it. What would be the best solution for this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "DB Parameter Groups.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Read Replicas.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Multi-AZ DB Instance deployment.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Database Snapshots.",
                "correct": false
            }
        ]
    },
    {
        "id": 342,
        "content": "One of the criteria for a new deployment is that the customer wants to use AWS Storage Gateway. However you are not sure whether you should use gateway-cached volumes or gateway-stored volumes or even what the differences are. Which statement below best describes those differences?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Gateway-cached lets you store your data in Amazon Simple Storage Service (Amazon S3) and retain a copy of frequently accessed data subsets locally. Gateway-stored enables you to configure your on-premises gateway to store all your data locally and then asynchronously back up point-in-time snapshots of this data to Amazon S3.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Gateway-cached is free whilst gateway-stored is not.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Gateway-cached is up to 10 times faster than gateway-stored.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Gateway-stored lets you store your data in Amazon Simple Storage Service (Amazon S3) and retain a copy of frequently accessed data subsets locally. Gateway-cached enables you to configure your on-premises gateway to store all your data locally and then asynchronously back up point-in-time snapshots of this data to Amazon S3.",
                "correct": false
            }
        ]
    },
    {
        "id": 343,
        "content": "In Amazon RDS, security groups are ideally used to:",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "Define maintenance period for database engines.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Launch Amazon RDS instances in a subnet.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create, describe, modify, and delete DB instances.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Control what IP addresses or EC2 instances can connect to your databases on a DB instance.",
                "correct": true
            }
        ]
    },
    {
        "id": 344,
        "content": "How long does an AWS free usage tier EC2 last for?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Forever.",
                "correct": false
            },
            {
                "id": 2,
                "content": "12 Months upon signup.",
                "correct": true
            },
            {
                "id": 3,
                "content": "1 Month upon signup.",
                "correct": false
            },
            {
                "id": 4,
                "content": "6 Months upon signup.",
                "correct": false
            }
        ]
    },
    {
        "id": 345,
        "content": "After you recommend Amazon Redshift to a client as an alternative solution to paying data warehouses to analyze his data, your client asks you to explain why you are recommending Redshift. Which of the following would be a reasonable response to his request?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "It has high performance at scale as data and query complexity grows.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It prevents reporting and analytic processing from interfering with the performance of OLTP workloads.",
                "correct": false
            },
            {
                "id": 3,
                "content": "You don't have the administrative burden of running your own data warehouse and dealing with setup, durability, monitoring, scaling, and patching.",
                "correct": false
            },
            {
                "id": 4,
                "content": "All answers listed are a reasonable response to his question.",
                "correct": true
            }
        ]
    },
    {
        "id": 346,
        "content": "You can seamlessly join an EC2 instance to your directory domain. What connectivity do you need to be able to connect remotely to this instance?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "You must have IP connectivity to the instance from the network you are connecting from.",
                "correct": true
            },
            {
                "id": 2,
                "content": "You must have the correct encryption keys to connect to the instance remotely.",
                "correct": false
            },
            {
                "id": 3,
                "content": "You must have enough bandwidth to connect to the instance.",
                "correct": false
            },
            {
                "id": 4,
                "content": "You must use MFA authentication to be able to connect to the instance remotely.",
                "correct": false
            }
        ]
    },
    {
        "id": 347,
        "content": "Does Amazon DynamoDB support both increment and decrement atomic operations?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon DynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale.",
        "answers": [
            {
                "id": 1,
                "content": "Only increment, since decrement are inherently impossible with DynamoDB's data model.",
                "correct": false
            },
            {
                "id": 2,
                "content": "No, neither increment nor decrement operations.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Yes, both increment and decrement operations.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Only decrement, since increment are inherently impossible with DynamoDB's data model.",
                "correct": false
            }
        ]
    },
    {
        "id": 348,
        "content": "You have multiple Amazon EC2 instances running in a cluster across multiple Availability Zones within the same region. What combination of the following should be used to ensure the highest network performance (packets per second), lowest latency, and lowest jitter? (Choose 3 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Amazon EC2 placement groups.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Enhanced networking.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Amazon PV AMI.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Amazon HVM AMI.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Amazon Linux.",
                "correct": false
            },
            {
                "id": 6,
                "content": "Amazon VPC.",
                "correct": false
            }
        ]
    },
    {
        "id": 349,
        "content": "If an Amazon EBS volume is the root device of an instance, can I detach it without stopping the instance?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Yes but only if Windows instance.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Yes but only if a Linux instance.",
                "correct": false
            }
        ]
    },
    {
        "id": 350,
        "content": "True or False: When you add a rule to a DB security group, you do not need to specify port number or protocol.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides multiple layers of security including network, application, and data protection.",
        "answers": [
            {
                "id": 1,
                "content": "Depends on the ROMS used.",
                "correct": false
            },
            {
                "id": 2,
                "content": "True.",
                "correct": true
            },
            {
                "id": 3,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 351,
        "content": "Before I delete an EBS volume, what can I do if I want to recreate the volume later?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Create a copy of the EBS volume (not a snapshot).",
                "correct": false
            },
            {
                "id": 2,
                "content": "Store a snapshot of the volume.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Download the content to an EC2 instance",
                "correct": false
            },
            {
                "id": 4,
                "content": "Back up the data in to a physical disk.",
                "correct": false
            }
        ]
    },
    {
        "id": 352,
        "content": "An accountant asks you to design a small VPC network for him and, due to the nature of his business, just needs something where the workload on the network will be low, and dynamic data will be accessed infrequently. Being an accountant, low cost is also a major factor. Which EBS volume type would best suit his requirements?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "Magnetic.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Any, as they all perform the same and cost the same.",
                "correct": false
            },
            {
                "id": 3,
                "content": "General Purpose (SSD).",
                "correct": false
            },
            {
                "id": 4,
                "content": "Magnetic or Provisioned IOPS (SSD).",
                "correct": false
            }
        ]
    },
    {
        "id": 353,
        "content": "Your company currently has a 2-tier web application running in an on-premises data center. You have experienced several infrastructure failures in the past two months resulting in significant financial losses. Your CIO is strongly agreeing to move the application to AWS. While working on achieving buy-in from the other company executives, he asks you to develop a disaster recovery plan to help improve Business continuity in the short term. He specifies a target Recovery Time Objective (RTO) of 4 hours and a Recovery Point Objective (RPO) of 1 hour or less. He also asks you to implement the solution within 2 weeks. Your database is 200GB in size and you have a 20Mbps Internet connection. How would you do this while minimizing costs?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS offers various cost optimization options including Reserved Instances, Spot Instances, and lifecycle policies.",
        "answers": [
            {
                "id": 1,
                "content": "Create an EBS backed private AMI which includes a fresh install of your application. Develop a CloudFormation template which includes your AMI and the required EC2, AutoScaling, and ELB resources to support deploying the application across Multiple Availability Zones. Asynchronously replicate transactions from your on-premises database to a database instance in AWS across a secure VPN connection.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Deploy your application on EC2 instances within an Auto Scaling group across multiple availability zones. Asynchronously replicate transactions from your on-premises database to a database instance in AWS across a secure VPN connection.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create an EBS backed private AMI which includes a fresh install of your application. Setup a script in your data center to backup the local database every 1 hour and to encrypt and copy the resulting file to an S3 bucket using multi-part upload.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Install your application on a compute-optimized EC2 instance capable of supporting the application's average load. Synchronously replicate transactions from your on-premises database to a database instance in AWS across a secure Direct Connect connection.",
                "correct": false
            }
        ]
    },
    {
        "id": 354,
        "content": "A customer implemented AWS Storage Gateway with a gateway-cached volume at their main office. An event takes the link between the main and branch office offline. Which methods will enable the branch office to access their data? (Choose 3 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Use a HTTPS GET to the Amazon S3 bucket where the files are located.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Restore by implementing a lifecycle policy on the Amazon S3 bucket.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Make an Amazon Glacier Restore API ca ll to load the files into another Amazon S3 bucket within four to six hours.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Launch a new AWS Storage Gateway instance AMI in Amazon EC2, and restore from a gateway snapshot.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Create an Amazon EBS volume from a gateway snapshot, and mount it to an Amazon EC2 instance.",
                "correct": true
            },
            {
                "id": 6,
                "content": "Launch an AWS Storage Gateway virtual iSCSI device at the branch office, and restore from a gateway snapshot.",
                "correct": true
            }
        ]
    },
    {
        "id": 355,
        "content": "Your customer is willing to consolidate their log streams (access logs, application logs, security logs, etc.) in one single system. Once consolidated, the customer wants to analyze these logs in real-time based on heuristics. From time to time, the customer needs to validate heuristics, which requires going back to data samples extracted from the last 12 hours. What is the best approach to meet your customer's requirements?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides multiple layers of security including network, application, and data protection.",
        "answers": [
            {
                "id": 1,
                "content": "Send all the log events to Amazon SQS. Setup an Auto Scaling group of EC2 servers to consume the logs and apply the heuristics.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Send all the log events to Amazon Kinesis. Develop a client process to apply heuristics on the logs.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Configure Amazon Cloud Trail to receive custom logs. Use EMR to apply heuristics to the logs.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Setup an Auto Scaling group of EC2 syslogd servers. Store the logs on S3. Use EMR to apply heuristics on the logs.",
                "correct": false
            }
        ]
    },
    {
        "id": 356,
        "content": "Can the string value of 'Key' be prefixed with laws?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "No.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Only for EC2 not S3.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Yes.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Only for S3 not EC.",
                "correct": false
            }
        ]
    },
    {
        "id": 357,
        "content": "You are configuring your company's application to use Auto Scaling and need to move user state information. Which of the following AWS services provides a shared data store with durability and low latency?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Auto Scaling helps maintain application availability and allows you to scale your applications automatically.",
        "answers": [
            {
                "id": 1,
                "content": "AWS ElastiCache Memcached.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Amazon Simple Storage Service.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Amazon EC2 instance storage.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Amazon DynamoDB.",
                "correct": false
            }
        ]
    },
    {
        "id": 358,
        "content": "Your company previously configured a heavily used, dynamically routed VPN connection between your on-premises data center and AWS. You recently provisioned a DirectConnect connection and would like to start using the new connection. After configuring DirectConnect settings in the AWS Console, which of the following options will provide the most seamless transition for your users?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Delete your existing VPN connection to avoid routing loops. Configure your DirectConnect router with the appropriate settings and verify network traffic is leveraging DirectConnect.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Configure your DirectConnect router with a higher BGP priority than your VPN router. Verify network traffic is leveraging DirectConnect and then delete your existing VPN connection.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Update your VPC route tables to point to the DirectConnect connection. Configure your DirectConnect router with the appropriate settings. Verify network traffic is leveraging DirectConnect and then delete the VPN connection.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Configure your DirectConnect router. Update your VPC route tables to point to the DirectConnect connection. Configure your VPN connection with a higher BGP priority and verify network traffic is leveraging the DirectConnect connection.",
                "correct": true
            }
        ]
    },
    {
        "id": 359,
        "content": "After setting up several database instances in Amazon Relational Database Service (Amazon RDS) you decide that you need to track the performance and health of your databases. How can you do this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "Subscribe to Amazon RDS events to be notified when changes occur with a DB instance, DB snapshot, DB parameter group, or DB security group.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Use the free Amazon CloudWatch service to monitor the performance and health of a DB instance.",
                "correct": false
            },
            {
                "id": 3,
                "content": "All of the items listed will track the performance and health of a database.",
                "correct": true
            },
            {
                "id": 4,
                "content": "View, download, or watch database log files using the Amazon RDS console or Amazon RDS APIs. You can also query some database log files that are loaded into database tables.",
                "correct": false
            }
        ]
    },
    {
        "id": 360,
        "content": "You deployed your company website using Elastic Beanstalk and you enabled log file rotation to S3. An Elastic MapReduce job is periodically analyzing the logs on S3 to build a usage dashboard that you share with your CIO. You recently improved overall performance of the website using CloudFront for dynamic content delivery and your website as the origin. After this architectural change, the usage dashboard shows that the traffic on your website dropped by an order of magnitude. How do you fix your usage dashboard?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "Enable CloudFront to deliver access logs to S3 and use them as input of the Elastic MapReduce job.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Turn on Cloud Trail and use trail log tiles on S3 as input of the Elastic MapReduce job.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Change your log collection process to use Cloud Watch ELB metrics as input of the Elastic Map Reduce job.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Use Elastic Beanstalk 'Rebuild Environment' option to update log delivery to the Elastic Map Reduce job.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Use Elastic Beanstalk 'Restart App server(s)' option to update log delivery to the Elastic Map Reduce job.",
                "correct": false
            }
        ]
    },
    {
        "id": 361,
        "content": "A customer has a 10 GB AWS Direct Connect connection to an AWS region where they have a web application hosted on Amazon Elastic Computer Cloud (EC2). The application has dependencies on an on-premises mainframe database that uses a BASE (Basic Available. Sort stale Eventual consistency) rather than an ACID (Atomicity. Consistency isolation. Durability) consistency model. The application is exhibiting undesirable behavior because the database is not able to handle the volume of writes. How can you reduce the load on your on-premises database resources in the most cost-effective way?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Use an Amazon Elastic MapReduce (EMR) S3DistCp as a synchronization mechanism between the on-premises database and a Hadoop cluster on AWS.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Modify the application to write to an Amazon SQS queue and develop a worker process to flush the queue to the on-premises database.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Modify the application to use DynamoDB to feed an EMR cluster which uses a map function to write to the on-premises database.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Provision an RDS read-replica database on AWS to handle the writes and synchronize the two databases using Data Pipeline.",
                "correct": false
            }
        ]
    },
    {
        "id": 362,
        "content": "You are very concerned about security on your network because you have multiple programmers testing APIs and SDKs and you have no idea what is happening. You think CloudTrail may help but are not sure what it does. Which of the following statements best describes the AWS service CloudTrail?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides multiple layers of security including network, application, and data protection.",
        "answers": [
            {
                "id": 1,
                "content": "With AWS CloudTrail you can get a history of AWS API calls and related events for your account.",
                "correct": true
            },
            {
                "id": 2,
                "content": "With AWS CloudTrail you can get a history of IAM users for your account.",
                "correct": false
            },
            {
                "id": 3,
                "content": "With AWS CloudTrail you can get a history of S3 logfiles for your account.",
                "correct": false
            },
            {
                "id": 4,
                "content": "With AWS CloudTrail you can get a history of CloudFormation JSON scripts used for your account.",
                "correct": false
            }
        ]
    },
    {
        "id": 363,
        "content": "Every user you create in the IAM system starts with [...].",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS IAM enables you to manage access to AWS services and resources securely.",
        "answers": [
            {
                "id": 1,
                "content": "partial permissions.",
                "correct": false
            },
            {
                "id": 2,
                "content": "full permissions.",
                "correct": false
            },
            {
                "id": 3,
                "content": "no permissions.",
                "correct": true
            }
        ]
    },
    {
        "id": 364,
        "content": "Amazon S3 allows you to set per-file permissions to grant read and/or write access. However you have decided that you want an entire bucket with 100 files already in it to be accessible to the public. You don't want to go through 100 files individually and set permissions. What would be the best way to do this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "Move the bucket to a new region.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Add a bucket policy to the bucket.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Move the files to a new bucket.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Use Amazon EBS instead of S3.",
                "correct": false
            }
        ]
    },
    {
        "id": 365,
        "content": "You are designing an SSUTLS solution that requires HTTPS clients to be authenticated by the Web server using client certificate authentication. The solution must be resilient. Which of the following options would you consider for configuring the web server infrastructure? (Choose 2 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Configure ELB with TCP listeners on TCP/4d3. And place the Web servers behind it.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Configure your Web servers with EIPS Place the Web servers in a Route 53 Record Set and configure health checks against all Web servers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Configure ELB with HTTPS listeners, and place the Web servers behind it.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Configure your web servers as the origins for a CloudFront distribution. Use custom SSL certificates on your CloudFront distribution.",
                "correct": false
            }
        ]
    },
    {
        "id": 366,
        "content": "Which of the following are use cases for Amazon DynamoDB? (Choose 3 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon DynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale.",
        "answers": [
            {
                "id": 1,
                "content": "Storing BLOB data.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Managing web sessions.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Storing JSON documents.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Storing metadata for Amazon S3 objects.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Running relational joins and complex updates.",
                "correct": false
            },
            {
                "id": 6,
                "content": "Storing large amounts of infrequently accessed data.",
                "correct": false
            }
        ]
    },
    {
        "id": 367,
        "content": "You have been asked to set up a database in AWS that will require frequent and granular updates. You know that you will require a reasonable amount of storage space but are not sure of the best option. What is the recommended storage option when you run a database on an instance with the above criteria?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Amazon S3.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Amazon EBS.",
                "correct": true
            },
            {
                "id": 3,
                "content": "AWS Storage Gateway.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Amazon Glacier.",
                "correct": false
            }
        ]
    },
    {
        "id": 368,
        "content": "An application hosted at the EC2 instance receives an HTTP request from ELB. The same request has an X-Forwarded-For header, which has three IP addresses. Which system's IP will be a part of this header?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Previous Request IP address.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Client IP address.",
                "correct": false
            },
            {
                "id": 3,
                "content": "All of the answers listed here.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Load Balancer IP address.",
                "correct": false
            }
        ]
    },
    {
        "id": 369,
        "content": "An organization has developed a mobile application which allows end users to capture a photo on their mobile device, and store it inside an application. The application internally uploads the data to AWS S3. The organization wants each user to be able to directly upload data to S3 using their Google ID. How will the mobile app allow this?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "Use the AWS Web identity federation for mobile applications, and use it to generate temporary security credentials for each user.",
                "correct": true
            },
            {
                "id": 2,
                "content": "It is not possible to connect to AWS S3 with a Google I",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create an IAM user every time a user registers with their Google ID and use IAM to upload files to S3.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Create a bucket policy with a condition which allows everyone to upload if the login ID has a Google part to it.",
                "correct": false
            }
        ]
    },
    {
        "id": 370,
        "content": "You must increase storage size in increments of at least [...].",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "40.",
                "correct": false
            },
            {
                "id": 2,
                "content": "20.",
                "correct": false
            },
            {
                "id": 3,
                "content": "50.",
                "correct": false
            },
            {
                "id": 4,
                "content": "10.",
                "correct": true
            }
        ]
    },
    {
        "id": 371,
        "content": "You need to set up a security certificate for a client's e-commerce website as it will use the HTTPS protocol. Which of the below AWS services do you need to access to manage your SSL server certificate?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides multiple layers of security including network, application, and data protection.",
        "answers": [
            {
                "id": 1,
                "content": "AWS Directory Service.",
                "correct": false
            },
            {
                "id": 2,
                "content": "AWS Identity & Access Management.",
                "correct": true
            },
            {
                "id": 3,
                "content": "AWS CloudFormation.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Amazon Route 53.",
                "correct": false
            }
        ]
    },
    {
        "id": 372,
        "content": "After setting up a Virtual Private Cloud (VPC) network, a more experienced cloud engineer suggests that to achieve low network latency and high network throughput you should look into setting up a placement group. You know nothing about this, but begin to do some research about it and are especially curious about its limitations. Which of the below statements is wrong in describing the limitations of a placement group?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "Although launching multiple instance types into a placement group is possible, this reduces the likelihood that the required capacity will be available for your launch to succeed.",
                "correct": false
            },
            {
                "id": 2,
                "content": "A placement group can span multiple Availability Zones.",
                "correct": true
            },
            {
                "id": 3,
                "content": "You can't move an existing instance into a placement group.",
                "correct": false
            },
            {
                "id": 4,
                "content": "A placement group can span peered VPCs.",
                "correct": false
            }
        ]
    },
    {
        "id": 373,
        "content": "True or False: When you perform a restore operation to a point in time or from a DB Snapshot, a new DB Instance is created with a new endpoint.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 374,
        "content": "What is the Reduced Redundancy option in Amazon S3?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "Less redundancy for a lower cost.",
                "correct": true
            },
            {
                "id": 2,
                "content": "It doesn't exist in Amazon S3, but in Amazon EBS.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It allows you to destroy any copy of your files outside a specific jurisdiction.",
                "correct": false
            },
            {
                "id": 4,
                "content": "It doesn't exist at all.",
                "correct": false
            }
        ]
    },
    {
        "id": 375,
        "content": "You are setting up your first Amazon Virtual Private Cloud (Amazon VPC) so you decide to use the VPC wizard in the AWS console to help make it easier for you. Which of the following statements is correct regarding instances that you launch into a default subnet via the VPC wizard?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon VPC allows you to provision a logically isolated section of the AWS Cloud.",
        "answers": [
            {
                "id": 1,
                "content": "Instances that you launch into a default subnet receive a public IP address and 10 private IP addresses.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Instances that you launch into a default subnet receive both a public IP address and a private IP address.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Instances that you launch into a default subnet don't receive any ip addresses and you need to define them manually.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Instances that you launch into a default subnet receive a public IP address and 5 private IP addresses.",
                "correct": false
            }
        ]
    },
    {
        "id": 376,
        "content": "For which of the following use cases are Simple Workflow Service (SWF) and Amazon EC2 an appropriate solution? (Choose 2 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Using as an endpoint to collect thousands of data points per hour from a distributed fleet of sensors.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Managing a multi-step and multi-decision checkout process of an e-commerce website.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Orchestrating the execution of distributed and auditable business processes.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Using as an SNS (Simple Notification Service) endpoint to trigger execution of video transcoding jobs.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Using as a distributed session store for your web application.",
                "correct": false
            }
        ]
    },
    {
        "id": 377,
        "content": "Which of the following instance types are available as Amazon EBS-backed only? (Choose 2 answers)",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "General purpose T2.",
                "correct": true
            },
            {
                "id": 2,
                "content": "General purpose M3.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Compute-optimized C4.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Compute-optimized C3.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Storage-optimized 12.",
                "correct": false
            }
        ]
    },
    {
        "id": 378,
        "content": "True or False: Without IAM, you cannot control the tasks a particular user or system can do and what AWS resources they might use.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS IAM enables you to manage access to AWS services and resources securely.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 379,
        "content": "What does Amazon ELB stand for?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Elastic Load Balancing automatically distributes incoming application traffic across multiple targets.",
        "answers": [
            {
                "id": 1,
                "content": "Elastic Linux Box.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Encrypted Linux Box.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Encrypted Load Balancing.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Elastic Load Balancing.",
                "correct": true
            }
        ]
    },
    {
        "id": 380,
        "content": "A read only news reporting site with a combined web and application tier and a database tier that receives large and unpredictable traffic demands must be able to respond to these traffic fluctuations automatically. What AWS services should be used meet these requirements?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Stateless instances for the web and application tier synchronized using Elasticache Memcached in an autoscaimg group monitored with CloudWatch. And RDSwith read replicas.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Stateful instances for the web and application tier in an autoscaling group monitored with CloudWatch and RDS with read replicas.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Stateful instances for the web and application tier in an autoscaling group monitored with CloudWatch and multi-AZ RDS.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Stateless instances for the web and application tier synchronized using ElastiCache Memcached in an autoscaling group monitored with CloudWatch and multi-AZ RDS.",
                "correct": false
            }
        ]
    },
    {
        "id": 381,
        "content": "In Amazon AWS, which of the following statements is true of key pairs?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Key pairs are used only for Amazon SDKs.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Key pairs are used only for Amazon EC2 and Amazon CloudFront.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Key pairs are used only for Elastic Load Balancing and AWS IA.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Key pairs are used for all Amazon services.",
                "correct": false
            }
        ]
    },
    {
        "id": 382,
        "content": "What does Amazon ElastiCache provide?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "A service by this name doesn't exist. Perhaps you mean Amazon CloudCache.",
                "correct": false
            },
            {
                "id": 2,
                "content": "A virtual server with a huge amount of memory.",
                "correct": false
            },
            {
                "id": 3,
                "content": "A managed In-memory cache service.",
                "correct": true
            },
            {
                "id": 4,
                "content": "An Amazon EC2 instance with the Memcached software already pre-installed.",
                "correct": false
            }
        ]
    },
    {
        "id": 383,
        "content": "What are the two permission types used by AWS?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Resource-based and Product-based.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Product-based and Service-based.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Service-based.",
                "correct": false
            },
            {
                "id": 4,
                "content": "User-based and Resource-based.",
                "correct": true
            }
        ]
    },
    {
        "id": 384,
        "content": "In AWS CloudHSM, in addition to the AWS recommendation that you use two or more HSM appliances in a high-availability configuration to prevent the loss of keys and data, you can also perform a remote backup/restore of a Luna SA partition if you have purchased a:",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS provides comprehensive backup and disaster recovery solutions across multiple services.",
        "answers": [
            {
                "id": 1,
                "content": "Luna Restore HS.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Luna Backup HS.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Luna HS.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Luna SA HS.",
                "correct": false
            }
        ]
    },
    {
        "id": 385,
        "content": "An organization has a statutory requirement to protect the data at rest for the S3 objects. Which of the below mentioned options need not be enabled by the organization to achieve data security?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon S3 provides scalable object storage with features like versioning, lifecycle management, and various storage classes.",
        "answers": [
            {
                "id": 1,
                "content": "MFA delete for S3 objects.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Client side encryption.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Bucket versioning.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Data replication.",
                "correct": true
            }
        ]
    },
    {
        "id": 386,
        "content": "Your company is in the process of developing a next generation pet collar that collects biometric information to assist families with promoting healthy lifestyles for their pets. Each collar will push 30kb of biometric data in JSON format every 2 seconds to a collection platform that will process and analyze the data providing health trending information back to the pet owners and veterinarians via a web portal. Management has tasked you to architect the collection platform ensuring the following requirements are met. Provide the ability for real-time analytics of the inbound biometric data. Ensure processing of the biometric data is highly durable, elastic and parallel. The results of the analytic processing should be persisted for data mining. Which architecture outlined below will meet the initial requirements for the collection platform?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Utilize S3 to collect the inbound sensor data, analyze the data from S3 with a daily scheduled Data Pipeline and save the results to a Redshift Cluster.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Utilize Amazon Kinesis to collect the inbound sensor data, analyze the data with Kinesis clients and save the results to a Redshift cluster using EMR.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Utilize SQS to collect the inbound sensor data, analyze the data from SQS with Amazon Kinesis and save the results to a Microsoft SQL Server RDS instance.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Utilize EMR to collect the inbound sensor data, analyze the data from EMR with Amazon Kinesis and save the results to DynamoDB.",
                "correct": false
            }
        ]
    },
    {
        "id": 387,
        "content": "Which of the following approaches provides the lowest cost for Amazon Elastic Block Store snapshots while giving you the ability to fully restore data?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. AWS offers various cost optimization options including Reserved Instances, Spot Instances, and lifecycle policies.",
        "answers": [
            {
                "id": 1,
                "content": "Maintain two snapshots: the original snapshot and the latest incremental snapshot.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Maintain a volume snapshot; subsequent snapshots will overwrite one another",
                "correct": false
            },
            {
                "id": 3,
                "content": "Maintain a single snapshot the latest snapshot is both Incremental and complete.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Maintain the most current snapshot, archive the original and incremental to Amazon Glacier.",
                "correct": false
            }
        ]
    },
    {
        "id": 388,
        "content": "You have a video transcoding application running on Amazon EC2. Each instance polls a queue to find out which video should be transcoded, and then runs a transcoding process. If this process is interrupted, the video will be transcoded by another instance based on the queuing system. You have a large backlog of videos which need to be transcoded and would like to reduce this backlog by adding more instances. You will need these instances only until the backlog is reduced. Which type of Amazon EC2 instances should you use to reduce the backlog in the most cost efficient way?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Reserved instances.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Spot instances.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Dedicated instances.",
                "correct": false
            },
            {
                "id": 4,
                "content": "On-demand instances.",
                "correct": false
            }
        ]
    },
    {
        "id": 389,
        "content": "What does the AWS Storage Gateway provide?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "It allows to integrate on-premises IT environments with Cloud Storage.",
                "correct": true
            },
            {
                "id": 2,
                "content": "A direct encrypted connection to Amazon S3.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It's a backup solution that provides an on-premises Cloud storage.",
                "correct": false
            },
            {
                "id": 4,
                "content": "It provides an encrypted SSL endpoint for backups in the Cloud.",
                "correct": false
            }
        ]
    },
    {
        "id": 390,
        "content": "You have recently joined a startup company building sensors to measure street noise and air quality in urban areas. The company has been running a pilot deployment of around 100 sensors for 3 months. Each sensor uploads 1KB of sensor data every minute to a backend hosted on AWS. During the pilot, you measured a peak of 10 IOPS on the database, and you stored an average of 3GB of sensor data per month in the database. The current deployment consists of a load-balanced auto scaled Ingestion layer using EC2 instances and a PostgreSQL RDS database with 500GB standard storage. The pilot is considered a success and your CEO has managed to get the attention of some potential investors. The business plan requires a deployment of at least 100K sensors which needs to be supported by the backend. You also need to store sensor data for at least two years to be able to compare year over year improvements. To secure funding, you have to make sure that the platform meets these requirements and leaves room for further scaling. Which setup will meet the requirements?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Add an SQS queue to the ingestion layer to buffer writes to the RDS instance.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Ingest data into a DynamoDB table and move old data to a Redshift cluster.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Replace the RDS instance with a 6 node Redshift cluster with 96TB of storage.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Keep the current architecture but upgrade RDS storage to 3TB and 10K provisioned IOPS.",
                "correct": false
            }
        ]
    },
    {
        "id": 391,
        "content": "After a major security breach your manager has requested a report of all users and their credentials in AWS. You discover that in IAM you can generate and download a credential report that lists all users in your account and the status of their various credentials, including passwords, access keys, MFA devices, and signing certificates. Which following statement is incorrect in regards to the use of credential reports?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon RDS provides managed relational database services with automated backups and scaling.",
        "answers": [
            {
                "id": 1,
                "content": "Credential reports are downloaded XML files.",
                "correct": true
            },
            {
                "id": 2,
                "content": "You can get a credential report using the AWS Management Console, the AWS CLI, or the IAM API.",
                "correct": false
            },
            {
                "id": 3,
                "content": "You can use the report to audit the effects of credential lifecycle requirements, such as password rotation.",
                "correct": false
            },
            {
                "id": 4,
                "content": "You can generate a credential report as often as once every four hours.",
                "correct": false
            }
        ]
    },
    {
        "id": 392,
        "content": "What is the maximum response time for a Business level Premium Support case?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "30 minutes.",
                "correct": false
            },
            {
                "id": 2,
                "content": "1 hour.",
                "correct": true
            },
            {
                "id": 3,
                "content": "12 hours.",
                "correct": false
            },
            {
                "id": 4,
                "content": "10 minutes.",
                "correct": false
            }
        ]
    },
    {
        "id": 393,
        "content": "Per the AWS Acceptable Use Policy, penetration testing of EC2 instances",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "May be performed by AWS, and will be performed by AWS upon customer request.",
                "correct": false
            },
            {
                "id": 2,
                "content": "May be performed by AWS, and is periodically performed by AWS.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Are expressly prohibited under all circumstances.",
                "correct": false
            },
            {
                "id": 4,
                "content": "May be performed by the customer on their own instances with prior authorization from AWS.",
                "correct": false
            },
            {
                "id": 5,
                "content": "May be performed by the customer on their own instances, only if performed from EC2 instances.",
                "correct": false
            }
        ]
    },
    {
        "id": 394,
        "content": "Which of the following features are provided by Amazon EC2?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Exadata Database Machine, Optimized Storage Management, Flashback Technology, and Data Warehousing.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Instances, Amazon Machine Images (AMIs), Key Pairs, Amazon EBS Volumes, Firewall, Elastic IP address, Tags, and Virtual Private Clouds (VPCs).",
                "correct": true
            },
            {
                "id": 3,
                "content": "Real Application Clusters (RAC), Elasticache Machine Images (EMIs), Data Warehousing, Flashback Technology, Dynamic IP address.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Exadata Database Machine, Real Application Clusters (RAC), Data Guard, Table and Index Partitioning, and Data Pump Compression.",
                "correct": false
            }
        ]
    },
    {
        "id": 395,
        "content": "True or False: If you add a tag that has the same key as an existing tag on a DB Instance, the new value overwrites the old value.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 396,
        "content": "You decide that you need to create a number of Auto Scaling groups to try and save some money as you have noticed that at certain times most of your EC2 instances are not being used. By default, what is the maximum number of Auto Scaling groups that AWS will allow you to create?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "12.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Unlimited.",
                "correct": false
            },
            {
                "id": 3,
                "content": "20.",
                "correct": true
            },
            {
                "id": 4,
                "content": "2.",
                "correct": false
            }
        ]
    },
    {
        "id": 397,
        "content": "After moving an E-Commerce website for a client from a dedicated server to AWS you have also set up auto scaling to perform health checks on the instances in your group and replace instances that fail these checks. Your client has come to you with his own health check system that he wants you to use as it has proved to be very useful prior to his site running on AWS. What do you think would be an appropriate response to this given all that you know about auto scaling?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Auto Scaling helps maintain application availability and allows you to scale your applications automatically.",
        "answers": [
            {
                "id": 1,
                "content": "It is not possible to implement your own health check system. You need to use AWSs health check system.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It is not possible to implement your own health check system due to compatibility issues.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It is possible to implement your own health check system and then send the instance's health information directly from your system to Cloud Watch.",
                "correct": true
            },
            {
                "id": 4,
                "content": "It is possible to implement your own health check system and then send the instance's health information directly from your system to Cloud Watch but only in the US East (Virginia) region.",
                "correct": false
            }
        ]
    },
    {
        "id": 398,
        "content": "You've been brought in as solutions architect to assist an enterprise customer with their migration of an e-commerce platform to Amazon Virtual Private Cloud (VPC) The previous architect has already deployed a 3-tier VPC, The configuration is as follows. VPC: vpc-2f8bc447. IGW: igw-2d8bc445. NACL: ad-208bc448. 5ubnets and Route Tables: Web servers: subnet-258bc44d. Application servers: subnet-248bc44c. Database servers: subnet-9189c6f9. Route Tables: rrb-218bc449, rtb-238bc44b. Associations: subnet-258bc44d: rtb-218bc449, subnet-248bc44c: rtb-238bc44b, subnet-9189c6f9: rtb-238bc44b. You are now ready to begin deploying EC2 instances into the VPC Web servers must have direct access to the internet Application and database servers cannot have direct access to the internet. Which configuration below will allow you the ability to remotely administer your application and database servers, as well as allow these servers to retrieve updates from the Internet?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities. Amazon EC2 provides scalable compute capacity in the cloud with various instance types and configurations.",
        "answers": [
            {
                "id": 1,
                "content": "Create a bastion and NAT instance in subnet-258bc44d, and add a route from rtb- 238bc44b to the NAT instance.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Add a route from rtb-238bc44b to igw-2d8bc445 and add a bastion and NAT instance within subnet-248bc44c.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create a bastion and NAT instance in subnet-248bc44c, and add a route from rtb- 238bc44b to subnet-258bc44d.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Create a bastion and NAT instance in subnet-258bc44d, add a route from rtb-238bc44b to lgw- 2d8bc445, and a new NACL that allows access between subnet-258bc44d and subnet -248bc44c.",
                "correct": false
            }
        ]
    },
    {
        "id": 399,
        "content": "After deciding that EMR will be useful in analysing vast amounts of data for a gaming website that you are architecting you have just deployed an Amazon EMR Cluster and wish to monitor the cluster performance. Which of the following tools cannot be used to monitor the cluster performance?",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "Kinesis.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Ganglia.",
                "correct": false
            },
            {
                "id": 3,
                "content": "CloudWatch Metrics.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Hadoop Web Interfaces.",
                "correct": false
            }
        ]
    },
    {
        "id": 400,
        "content": "A/An [...] is the concept of allowing (or disallowing) an entity such as a user, group, or role some type of access to one or more resources.",
        "reason": "This is the correct answer based on AWS best practices and service capabilities.",
        "answers": [
            {
                "id": 1,
                "content": "user.",
                "correct": false
            },
            {
                "id": 2,
                "content": "AWS Account.",
                "correct": true
            },
            {
                "id": 3,
                "content": "resource.",
                "correct": false
            },
            {
                "id": 4,
                "content": "permission.",
                "correct": false
            }
        ]
    }
]