[
    {
        "id": 1,
        "content": "You have just been hired by a company new to Scrum. Your management has assigned you to be the Scrum Master of six new Scrum Teams. These teams will build one product. Select two conditions you should strive for in this scenario. (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "There should be six Product Owners, one for each Scrum Team.",
                "correct": false
            },
            {
                "id": 2,
                "content": "There should be six Product Owners, reporting to a chief Product Owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The product has one Product Backlog.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Each Scrum Team should have a separate Product Backlog.",
                "correct": false
            },
            {
                "id": 5,
                "content": "There should be only one Product Owner.",
                "correct": true
            }
        ]
    },
    {
        "id": 2,
        "content": "A Scrum Team has been working on a product for nine Sprints. A new Product Owner comes in, understanding he is accountable for the Product Backlog. However, he is unsure about his responsibilities. Which two activities are part of the Product Owner role according to Scrum? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Ensuring that the most valuable functionality is produced first, at all times.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Interacting with stakeholders.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Providing the Scrum Team with detailed specifications.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Describing features as Use Cases.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Creating detailed functional test cases.",
                "correct": false
            }
        ]
    },
    {
        "id": 3,
        "content": "User documentation is part of your Definition of Done. However, there aren't enough technical writers for all teams. Your Developers don't have a technical writer. What should you do?",
        "answers": [
            {
                "id": 1,
                "content": "Form a separate team of technical writers that will work on an on-demand basis for the various Product Owners. Work order will be first in, first out.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Let the user documentation remain undone and accumulate until after the last development Sprint. It will then be done by any available technical writers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Wait until you have a technical writer on your Scrum Team to take care of this.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Your Scrum Team is still responsible for creating user documentation. In this case, the Scrum Team members will write it.",
                "correct": true
            }
        ]
    },
    {
        "id": 4,
        "content": "You are the Scrum Master for four Scrum Teams working from the same Product Backlog. Several of the Developers come to you complaining that work identified for the upcoming two Sprints will require full-time commitment from a technical specialist who is external to the teams. What are two key concerns for the Scrum Master to take into account in this situation? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "The desire to maintain a stable velocity.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The benefit of Developers figuring out a solution for themselves.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The need to have enough work to keep all Developers busy.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The ability of the Developers to produce integrated Increments.",
                "correct": true
            }
        ]
    },
    {
        "id": 5,
        "content": "The Product Backlog is ordered by:",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner with the most valuable items placed at the top.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Risk, where safer items are at the top, and riskier items are at the bottom.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Items are randomly arranged.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Size, where small items are at the top and large items are at the bottom.",
                "correct": false
            }
        ]
    },
    {
        "id": 6,
        "content": "What happens if the Scrum Team cannot complete its work by the end of the Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Sprint is extended and future Sprints use this new duration.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Sprint length holds and the Scrum Team continuously learns what is actually possible to do within a Sprint of this length.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Sprint is extended temporarily. Lessons are taken to ensure it doesn't happen again.",
                "correct": false
            }
        ]
    },
    {
        "id": 7,
        "content": "Which topics should be discussed in the Sprint Review?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum process, and how it was used during the Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Coding and engineering practices.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Sprint results.",
                "correct": true
            },
            {
                "id": 4,
                "content": "All of the above.",
                "correct": false
            }
        ]
    },
    {
        "id": 8,
        "content": "A member of the Scrum Team takes the Scrum Master aside to express his concerns about data security issues. What should the Scrum Master do?",
        "answers": [
            {
                "id": 1,
                "content": "Add security to the Definition of Done.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Tell the Product Owner to stop further development of features until the issues are fixed.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Create a Product Backlog item for security.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Go check with the testers.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Ask the person to share the issue with the team as soon as possible.",
                "correct": true
            }
        ]
    },
    {
        "id": 9,
        "content": "What does it mean for a Scrum Team to be cross-functional?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Team includes not only Developers but also business analysts, architects, and testers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Team includes cross-skilled individuals who are able to contribute to do what is necessary to deliver an Increment of software.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Developers on the Scrum Team work closely with business analysts, architects, Developers and testers who are not on the team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Team is a virtual team drawing from separate teams of business analysts, architects, Developers and testers.",
                "correct": false
            }
        ]
    },
    {
        "id": 10,
        "content": "Sprint burndown charts are an efficient tracking tool, because they show:",
        "answers": [
            {
                "id": 1,
                "content": "An estimate of the total work remaining for the Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "How much effort has gone into a Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "How many hours have been worked by each Scrum Team member.",
                "correct": false
            },
            {
                "id": 4,
                "content": "How many Product Backlog items remain.",
                "correct": false
            }
        ]
    },
    {
        "id": 11,
        "content": "How much work must a Scrum Team do to a Product Backlog item it selects for a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "A proportional amount of time on analysis, design, programming, testing, and documentation.",
                "correct": false
            },
            {
                "id": 2,
                "content": "As much as it can fit into the Sprint. Any remaining work will be transferred to a subsequent Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "All development work and at least some testing.",
                "correct": false
            },
            {
                "id": 4,
                "content": "As much as it has told the Product Owner will be done for every Product Backlog item it selects in conformance with the Definition of Done.",
                "correct": true
            }
        ]
    },
    {
        "id": 12,
        "content": "Which statement best describes the Sprint Backlog as outcome of the Sprint Planning?",
        "answers": [
            {
                "id": 1,
                "content": "It is a complete list of all work to be done in a Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Every item has a designated owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Each task is estimated in hours.",
                "correct": false
            },
            {
                "id": 4,
                "content": "It is the Scrum Team's plan for the Sprint.",
                "correct": true
            },
            {
                "id": 5,
                "content": "It is ordered by the Product Owner.",
                "correct": false
            }
        ]
    },
    {
        "id": 13,
        "content": "If burndown charts are used to visualize progress, what does a trend line through a release burndown chart indicate? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The evolution of the cost spent on the project.",
                "correct": false
            },
            {
                "id": 2,
                "content": "When all work will be completed to the Scrum Team can be released for other work.",
                "correct": false
            },
            {
                "id": 3,
                "content": "When the work remaining will likely be completed if nothing changes on the Product Backlog or the Developers.",
                "correct": true
            },
            {
                "id": 4,
                "content": "When the project will be over if the Product Owner removes work that is equal in effort to any new work that is added.",
                "correct": false
            }
        ]
    },
    {
        "id": 14,
        "content": "Who is responsible for engaging the stakeholders? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Business Analyst.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Team Manager.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Project Manager.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Product Owner.",
                "correct": true
            }
        ]
    },
    {
        "id": 15,
        "content": "At the end of a Sprint, a Product Backlog item worked on during the Sprint does not meet the Definition of Done. What two things should happen with the undone Product Backlog item? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "If the stakeholders agree, the Product Owner can accept it and release it to the users.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Put it on the Product Backlog for the Product Owner to decide what to do with it.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Review the item, add the Done part of the estimate to the velocity and create a Story for the remaining work.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Do not include the item in the Increment this Sprint.",
                "correct": true
            }
        ]
    },
    {
        "id": 16,
        "content": "Which two of the following are true about the Scrum Master role? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "At the Sprint Review, the Scrum Master identifies what has been \"done\" and what has not been \"done\".",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Master teaches the Developers to keep the Scrum meetings to their time-box.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Scrum Master helps those outside the team interact with the Scrum Team.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Scrum Master assigns tasks to Developers when they need work.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Scrum Master is responsible for updating the Sprint Burndown.",
                "correct": false
            }
        ]
    },
    {
        "id": 17,
        "content": "What are three benefits of self-management? (choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "Increased creativity.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Increased rule compliance.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Increased accuracy of estimates.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Increased self-accountability",
                "correct": true
            },
            {
                "id": 5,
                "content": "Increased commitment.",
                "correct": true
            }
        ]
    },
    {
        "id": 18,
        "content": "Which three of the following are time-boxed events in Scrum? (choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "Release Testing.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Release Retrospective.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Sprint Retrospective.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Sprint Planning.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Sprint Testing.",
                "correct": false
            },
            {
                "id": 6,
                "content": "Sprint 0.",
                "correct": false
            },
            {
                "id": 7,
                "content": "Daily Scrum.",
                "correct": true
            }
        ]
    },
    {
        "id": 19,
        "content": "Who is responsible for clearly expressing Product Backlog items? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master, or the Scrum Master may have the Developers do it.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The business analyst who represents the Product Owner in the Scrum Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 20,
        "content": "What is the best suited structure for Scrum Teams in order to produce integrated Increments? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Each Scrum Team works only one technical layer of the system (e.g. GUI, database, middle tier, interfaces).",
                "correct": false
            },
            {
                "id": 2,
                "content": "Each Scrum Team develops functionality from beginning to end throughout all technical layers.",
                "correct": true
            }
        ]
    },
    {
        "id": 21,
        "content": "Why should the Product Owner be present at the Daily Scrum? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "He/She doesn't need to be there.",
                "correct": true
            },
            {
                "id": 2,
                "content": "To hear about impediments in functionality.",
                "correct": false
            },
            {
                "id": 3,
                "content": "To represent the stakeholder's point of view.",
                "correct": false
            },
            {
                "id": 4,
                "content": "To participate as a Scrum Team member.",
                "correct": false
            }
        ]
    },
    {
        "id": 22,
        "content": "What two techniques could the Scrum Master use when the Scrum Team gets caught in an internal disagreement about which development techniques to apply? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Involve the complete Scrum Team.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Use coaching techniques; such as open questions and active listening.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Ask an external technical specialist to make the decision.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Send every team member to the company's Human Resources department to express their concerns.",
                "correct": false
            }
        ]
    },
    {
        "id": 23,
        "content": "What enhances the transparency of an Increment? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Doing all work needed to meet the Definition of Done",
                "correct": true
            },
            {
                "id": 2,
                "content": "Reporting Sprint progress to the stakeholders daily",
                "correct": false
            },
            {
                "id": 3,
                "content": "Keeping track of and estimating all undone work to be completed in a separate Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Updating Sprint tasks properly in the electronic tracking tool.",
                "correct": false
            }
        ]
    },
    {
        "id": 24,
        "content": "Who determines how work is performed during the Sprint? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Architects.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Team.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Subject matter experts.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers managers.",
                "correct": false
            }
        ]
    },
    {
        "id": 25,
        "content": "When does the second Sprint start? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Once the architectural changes for the second Sprint have been approved by the senior architect.",
                "correct": false
            },
            {
                "id": 2,
                "content": "After the Product Backlog for the second Sprint has been selected.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Immediately after the first Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "After the customer completes acceptance testing of the first Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 26,
        "content": "What is included in the Sprint Backlog? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "User Stories.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Tasks.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Use Cases.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Tests.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Any of the above (or others) which are a decomposition of the selected Product Backlog items.",
                "correct": true
            }
        ]
    },
    {
        "id": 27,
        "content": "Which of the following are true about the Product Owner role? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner is one person.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Product Owner is accountable for ordering the Product Backlog.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Multiple people can share the Product Owner role on a Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Product Owner role can be played by a committee or a team of people.",
                "correct": false
            }
        ]
    },
    {
        "id": 28,
        "content": "True or False: When multiple teams work together on the same product, each team should maintain a separate Product Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 29,
        "content": "If two Scrum Teams are added to the development of a product that previously had only one Scrum Team, what will be the immediate impact on the productivity of the original Scrum Team? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Its productivity is likely to decrease.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Its productivity is likely to stay the same.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Its productivity is likely to increase.",
                "correct": false
            }
        ]
    },
    {
        "id": 30,
        "content": "A Scrum Master is introducing Scrum to a new Scrum Team. The Scrum Team has decided that a Sprint Retrospective is unnecessary. What action should the Scrum Master take? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Call a meeting between the Scrum Team and senior management.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Comply with the decision of the self-managing team.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Consult with the Product Owner to see how he/she feels about the situation.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Begin facilitating productive and useful Sprint Retrospectives.",
                "correct": true
            }
        ]
    },
    {
        "id": 31,
        "content": "Which two things are appropriate for a Scrum Master to do if the Developers don't have the engineering tools and infrastructure to completely finish each selected Product Backlog item? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Coach the Scrum Team to improve its skills, tools, and infrastructure over time and adjust the Definition of Done accordingly.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Encourage the Product Owner to accept partially \"Done\" Increments until the situation improves.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Refocus the current Sprint on establishing the Scrum Team's infrastructure instead of delivering an Increment.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Declare the Scrum Team not ready for Scrum.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Have the Scrum Team establish a Definition of Done that is actually possible to achieve given current circumstances.",
                "correct": true
            }
        ]
    },
    {
        "id": 32,
        "content": "When is implementation of a Product Backlog item considered complete? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "At the end of the Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "When the item has no work remaining in order to be potentially released.",
                "correct": true
            },
            {
                "id": 3,
                "content": "When QA reports that the item passes all acceptance criteria.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When all work in the Sprint Backlog related to the item is finished.",
                "correct": false
            }
        ]
    },
    {
        "id": 33,
        "content": "Choose two responsibilities of a self-managing Scrum Team. (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Reorder the Product Backlog.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Pull Product Backlog items for the Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Do the work planned in the Sprint Backlog.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Increase velocity.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Report daily progress to stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 34,
        "content": "Every Scrum Team should have: (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "At least one representative from each major software engineering discipline (like QA, Dev, UX).",
                "correct": false
            },
            {
                "id": 2,
                "content": "The competencies and skills needed to deliver a Done Increment in a Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "One Lead Developer and no more than 8 other members.",
                "correct": false
            }
        ]
    },
    {
        "id": 35,
        "content": "Why does the Product Owner want the Scrum Team to adhere to its Definition of Done? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "To have complete transparency into what has been done at the end of each Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "To be able to reprimand the team when they don't meet their velocity goal for the Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "To know what the team will deliver over the next three Sprints.",
                "correct": false
            },
            {
                "id": 4,
                "content": "To predict the team's productivity over time.",
                "correct": false
            }
        ]
    },
    {
        "id": 36,
        "content": "During a Sprint Retrospective, for what is the Scrum Master responsible? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Prioritizing the resulting action items.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Participating as a Scrum team member and facilitating as requested or needed.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Acting as a scribe to capture the Developers answers.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Summarizing and reporting the discussions to management.",
                "correct": false
            }
        ]
    },
    {
        "id": 37,
        "content": "The Scrum Team should have all the skills needed to: (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Turn Product Backlog items into an Increment of potentially releasable product functionality.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Do all of the development work, except for specialized testing that requires additional tools and environments.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Complete the project within the date and cost as calculated by the Product Owner.",
                "correct": false
            }
        ]
    },
    {
        "id": 38,
        "content": "During the Sprint, the Scrum Master's role is to do which two of the following: (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Facilitate inspection and adaptation opportunities as requested or needed.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Coaching the team members in the self-management.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Ensure the Product Owner attends all Scrum events.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Escalate team conflicts to functional line managers.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Monitor the progress of the Developers.",
                "correct": false
            },
            {
                "id": 6,
                "content": "Assign tasks with the Scrum Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 39,
        "content": "The Scrum Master observes the Product Owner struggling with ordering the Product Backlog. What is an appropriate action for the Scrum Master to take? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Suggest the Product Owner extend the Sprint, so he can have more time to order the Product Backlog.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Suggest that the Developers do the ordering to be sure that it is a feasible ordering of work.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Offer the Product Owner help in understanding that the goal of ordering the Product Backlog is to maximize value.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Present the Product Owner with an ordered Product Backlog to use.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Encourage the Product Owner to work with the Developers to see which items technically are fastest to implement.",
                "correct": false
            }
        ]
    },
    {
        "id": 40,
        "content": "True or False: The Product Owner makes sure the team selects enough from the Product Backlog for a Sprint to satisfy the stakeholders.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 41,
        "content": "Which statement best describes the Sprint Review? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "It is used to congratulate the Developers if it did what it forecast, or to punish the Developers if it failed to meet its forecast.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It is a demo at the end of the Sprint for everyone in the organization to check on the work done.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It is a mechanism to control the Developers activities during a Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "It is when the Scrum Team and stakeholders inspect the outcome of a Sprint and figure out what to do next.",
                "correct": true
            }
        ]
    },
    {
        "id": 42,
        "content": "Who owns the Sprint Backlog? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Chief Backlog Officer.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Team.",
                "correct": true
            }
        ]
    },
    {
        "id": 43,
        "content": "When might a Sprint be abnormally cancelled? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "When the Scrum Team feels that the work is too hard.",
                "correct": false
            },
            {
                "id": 2,
                "content": "When the Sprint Goal becomes obsolete.",
                "correct": true
            },
            {
                "id": 3,
                "content": "When the sales department has an important new opportunity.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When it becomes clear that not everything will be finished by the end of the Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 44,
        "content": "A Sprint Retrospective should be held: (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "At the end of each Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "At the beginning of each Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Only when the Scrum Team determines it needs one.",
                "correct": false
            },
            {
                "id": 4,
                "content": "At the end of the last Sprint in a project or a release.",
                "correct": false
            }
        ]
    },
    {
        "id": 45,
        "content": "A new Developer is having continuing conflicts with existing Developers and creating the hostile environment. If necessary, who is responsible for removing the team member? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The hiring manager is responsible, because he/she hired the Developer.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Manager is responsible, because he/she removes Impediments.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers are responsible, and may need help from the Scrum Master.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Product Owner is responsible, because he/she controls the return on investment (ROI).",
                "correct": false
            }
        ]
    },
    {
        "id": 46,
        "content": "Which three purposes does the Definition of Done serve? (choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "Guide the Developers on how many Product Backlog items to select for the Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Create a shared understanding of when work is complete.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Describe the purpose, objective, and time-box of each Scrum event.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Describe the work that must be done before the Sprint is allowed to end.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Increase transparency.",
                "correct": true
            }
        ]
    },
    {
        "id": 47,
        "content": "During a Sprint Retrospective, the Developers proposes moving the Daily Scrum to only occur on Tuesdays and Thursdays. Which two are the most appropriate responses for the Scrum Master? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Consider the request and decide on which days the Daily Scrum should occur.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Coach the team on why the Daily Scrum is important as an opportunity to update the plan.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Have the Developers vote.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Learn why the Developers wants this and work with them to improve the outcome of the Daily Scrum.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Acknowledge and support the self-managing team's decision.",
                "correct": false
            }
        ]
    },
    {
        "id": 48,
        "content": "When should a Sprint Goal be created? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "It should have been created in the previous Sprint during Product Backlog refinement.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It must be established before Sprint Planning in order to begin planning.",
                "correct": false
            },
            {
                "id": 3,
                "content": "A Sprint Goal is not mandatory in Scrum.",
                "correct": false
            },
            {
                "id": 4,
                "content": "At any time during the Sprint.",
                "correct": false
            },
            {
                "id": 5,
                "content": "During Sprint Planning.",
                "correct": true
            }
        ]
    },
    {
        "id": 49,
        "content": "True or False: Every Scrum team must have a Product Owner and Scrum Master.",
        "answers": [
            {
                "id": 1,
                "content": "True. Outcomes affected by their participation and availability.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False. A Product Owner can be replaced by a business analyst in the Scrum Team.",
                "correct": false
            },
            {
                "id": 3,
                "content": "False. A Scrum Master is only required when asked for by the Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "True. Each must be 100% dedicated to the Scrum Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 50,
        "content": "Who can abnormally terminate a Sprint? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Team or its members.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 51,
        "content": "True or False: The Sprint Goal is a result of Sprint Planning, as is the Sprint Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 52,
        "content": "Which two of the following are appropriate topics for discussion during a Sprint Retrospective? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Identifying high priority process improvements for the next Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The order of items in the Product Backlog.",
                "correct": false
            },
            {
                "id": 3,
                "content": "How the team collaborates.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Documenting acceptance criteria for items in the next Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 53,
        "content": "A Scrum Master is working with a Scrum Team that has members in different physical locations. The Scrum Team meets in a variety of meeting rooms and has much to do logistically (for example, set up conference calls) before the Daily Scrum. What action should the Scrum Master take? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Allow the Scrum Team to self-manage and determine for itself what to do.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Set up the meeting and tell the Scrum Team that is how it will be done.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Ask the Scrum Team members to alternate who is responsible for meeting setup.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Inform management and ask them to solve it.",
                "correct": false
            }
        ]
    },
    {
        "id": 54,
        "content": "True or False: Cross-functional teams are optimized to work on one technical layer of a system only (e.g. GUI, database, middle tier, interfaces).",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 55,
        "content": "Which of the following might the Scrum Team discuss during a Sprint Retrospective? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Methods of communication.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The way the Scrum Team does Sprint Planning.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Skills needed to improve the Developers ability to deliver.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Its Definition of Done.",
                "correct": false
            },
            {
                "id": 5,
                "content": "All of the above.",
                "correct": true
            }
        ]
    },
    {
        "id": 56,
        "content": "What are the two primary ways a Scrum Master keeps a Developers working at its highest level of productivity? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "By ensuring the meetings start and end at the proper time.",
                "correct": false
            },
            {
                "id": 2,
                "content": "By removing impediments that hinder the Developers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "By facilitating Developers decisions.",
                "correct": true
            },
            {
                "id": 4,
                "content": "By keeping high value features high in the Product Backlog.",
                "correct": false
            }
        ]
    },
    {
        "id": 57,
        "content": "What is the recommended size for the Developers? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "7 plus or minus 3.",
                "correct": false
            },
            {
                "id": 2,
                "content": "At least 7.",
                "correct": false
            },
            {
                "id": 3,
                "content": "9.",
                "correct": false
            },
            {
                "id": 4,
                "content": "3 to 9.",
                "correct": true
            }
        ]
    },
    {
        "id": 58,
        "content": "You are the Scrum Master of a new, to be developed product. Development is going to require 45 people. What is a good first question-for you to suggest the group thinks about when forming into teams? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "How will we make sure all teams have the right amount or expertise?",
                "correct": true
            },
            {
                "id": 2,
                "content": "What is the right mixture of senior and junior people on each team?",
                "correct": false
            },
            {
                "id": 3,
                "content": "Who are going to be the team leads?",
                "correct": false
            },
            {
                "id": 4,
                "content": "Who are the subject matter experts on each team?",
                "correct": false
            }
        ]
    },
    {
        "id": 59,
        "content": "Which three of the following are feedback loops in Scrum? (choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "Sprint Review.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Release Planning.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Sprint Retrospective.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Refinement Meeting.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Daily Scrum.",
                "correct": true
            }
        ]
    },
    {
        "id": 60,
        "content": "When the Developers are having trouble delivering a working Increment because they don't understand a functional requirement, what should they do? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Add a specialist to the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Partially complete the functionality, and discuss the remaining work at the Sprint Review.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Collaborate with the Product Owner to determine what is possible and acceptable.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Defer the work to a more appropriate Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 61,
        "content": "When is the Sprint Backlog created? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "At the beginning of the project.",
                "correct": false
            },
            {
                "id": 2,
                "content": "During the Sprint Planning meeting.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Prior to the Sprint Planning meeting.",
                "correct": false
            },
            {
                "id": 4,
                "content": "During the Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 62,
        "content": "Which of the following services are appropriate for a Scrum Master in regard to the Daily Scrum? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Lead the discussions of the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Make sure that all 3 questions have been answered by each member of the team.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Keep track of whether each team member has a chance to speak.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Teach the Developers to keep the Daily Scrum within the 15 minute time-box.",
                "correct": true
            },
            {
                "id": 5,
                "content": "All of the above.",
                "correct": false
            }
        ]
    },
    {
        "id": 63,
        "content": "Which of the following best describes an Increment of working software? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "A decomposition of all Product Backlog items into tasks for future Sprint Backlog lists.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Additional features in a usable state that complement those delivered in previous iterations.",
                "correct": true
            },
            {
                "id": 3,
                "content": "A new user interface design for functionality delivered in previous iterations.",
                "correct": false
            },
            {
                "id": 4,
                "content": "An automated test suite to verify functionality delivered in previous iterations.",
                "correct": false
            },
            {
                "id": 5,
                "content": "UML diagrams that describe how to deliver functionality in future iterations.",
                "correct": false
            }
        ]
    },
    {
        "id": 64,
        "content": "In order to achieve the benefits of Scrum, it is important to enact the value of commitment. What two actions demonstrate the commitment of Scrum Team members? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Always deliver the items in the Sprint forecast.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Help the other Scrum Team members.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Do your best",
                "correct": true
            },
            {
                "id": 4,
                "content": "Send out a daily status report.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Work late.",
                "correct": false
            }
        ]
    },
    {
        "id": 65,
        "content": "True or False: The Product Owner determines how many Product Backlog items the Developers selects for a Sprint. (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "False.",
                "correct": true
            },
            {
                "id": 2,
                "content": "True, accordingly to what was committed to the stakeholders.",
                "correct": false
            },
            {
                "id": 3,
                "content": "True, but only after confirmation by the resource manager that the Team has enough capacity.",
                "correct": false
            },
            {
                "id": 4,
                "content": "True.",
                "correct": false
            },
            {
                "id": 5,
                "content": "False, the Scrum Master does that.",
                "correct": false
            },
            {
                "id": 6,
                "content": "False, capacity and commitment are the Project manager's responsibility.",
                "correct": false
            }
        ]
    },
    {
        "id": 66,
        "content": "What are two ways that regulatory compliance requirements are dealt with in Scrum? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "They are addressed by a separate team who is responsible for compliance issues.",
                "correct": false
            },
            {
                "id": 2,
                "content": "They are discussed, analyzed, and documented before the first Sprint can begin.",
                "correct": false
            },
            {
                "id": 3,
                "content": "They are added to the Product Backlog and addressed during each Sprint, alongside the creation of new Product capabilities.",
                "correct": true
            },
            {
                "id": 4,
                "content": "They are addressed as part of meeting the Definition of Done during each Sprint.",
                "correct": true
            }
        ]
    },
    {
        "id": 67,
        "content": "The Sprint Review is mainly an inspect and adapt opportunity for which group?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers and stakeholders.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner and Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Scrum Team and stakeholders.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Product Owner and management.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers and management.",
                "correct": false
            },
            {
                "id": 6,
                "content": "The Product Owner and stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 68,
        "content": "True or False: To get started in terms of what to build, Scrum requires no more than a Product Owner with enough ideas for a first Sprint, Developers to implement those ideas and a Scrum Master to help guide the process.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 69,
        "content": "What is the time-box for the Sprint Review?",
        "answers": [
            {
                "id": 1,
                "content": "As long as needed.",
                "correct": false
            },
            {
                "id": 2,
                "content": "2 hours for a monthly Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "4 hours for a monthly Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "4 hours and longer as needed.",
                "correct": false
            },
            {
                "id": 5,
                "content": "1 day",
                "correct": false
            }
        ]
    },
    {
        "id": 70,
        "content": "Who is responsible for tracking the remaining work of the Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Project Manager.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Developers is consultation with the Product Owner.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Product Owner.",
                "correct": false
            }
        ]
    },
    {
        "id": 71,
        "content": "What is the tactic a Scrum Master should use to divide a group of 100 people into multiple Scrum Teams?",
        "answers": [
            {
                "id": 1,
                "content": "Create teams based on their skills across multiple layers (such as database, UI, etc.)",
                "correct": false
            },
            {
                "id": 2,
                "content": "Ask the Product Owner to assign the people to teams.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Ask the Developers to divide themselves into teams.",
                "correct": true
            }
        ]
    },
    {
        "id": 72,
        "content": "True or False: A product Increment must be released to production at the end of each Sprint.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 73,
        "content": "If burndown charts are used to visualize progress, what do they track?",
        "answers": [
            {
                "id": 1,
                "content": "Accumulated cost.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Individual worker productivity.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Work remaining across time.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Accumulated business value delivered to the customer.",
                "correct": false
            }
        ]
    },
    {
        "id": 74,
        "content": "How is management external to the Scrum Team involved in the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master speaks on their behalf.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Team self-manages and is the only management required at the Daily Scrum.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Management gives an update at the start of each Daily Scrum.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Product Owner represents their opinions.",
                "correct": false
            }
        ]
    },
    {
        "id": 75,
        "content": "A Scrum Master is keeping a list of open impediments, but it is growing and he/she has been able to resolve only a small portion of the impediments. Which three techniques would be most helpful in this situation? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "Consulting with the Scrum Team.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Prioritizing the list and working on them in order.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Arranging a triage meeting with all project managers.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Alerting management to the impediments and their impact.",
                "correct": true
            }
        ]
    },
    {
        "id": 76,
        "content": "Which Scrum Value is affected by a lack of trust in the Scrum Team?",
        "answers": [
            {
                "id": 1,
                "content": "Focus.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Respect.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Openness.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Courage.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Commitment.",
                "correct": false
            },
            {
                "id": 6,
                "content": "All of the above.",
                "correct": true
            }
        ]
    },
    {
        "id": 77,
        "content": "What is the time-box for the Sprint Planning meeting?",
        "answers": [
            {
                "id": 1,
                "content": "4 Hours for a monthly Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "8 Hours for a monthly Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Monthly.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Whenever it is done.",
                "correct": false
            }
        ]
    },
    {
        "id": 78,
        "content": "A Product Owner wants advice from the Scrum Master about estimating work in Scrum. Which of these is the guideline that a Scrum Master should give?",
        "answers": [
            {
                "id": 1,
                "content": "Product Backlog items must be estimated in story points.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Estimates are made by the Scrum Team.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Estimates must be in relative units.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Scrum forbids estimating.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Estimates are made by the Product Owner, but are best checked with the Scrum Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 79,
        "content": "What is a Scrum Team responsible for? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Resolving internal team conflicts.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Reporting productivity.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Selecting the Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Organizing the work required to meet the Sprint Goal.",
                "correct": true
            }
        ]
    },
    {
        "id": 80,
        "content": "Which two ways of creating Scrum Teams are consistent with Scrum's values? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Existing teams propose how they would like to go about organizing into the new structure.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Managers personally re-assign current subordinates to new teams.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Managers collaborate to assign individuals to specific teams.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Bring all the Developers together and let them self-manage into Scrum Teams.",
                "correct": true
            },
            {
                "id": 5,
                "content": "The Chief Product Owner determines the new team structures and assignments.",
                "correct": false
            }
        ]
    },
    {
        "id": 81,
        "content": "True or False: A Scrum Master is essentially the same thing as a traditional PM (Project Manager).",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 82,
        "content": "The Product Owner is not collaborating with the Developers during the Sprint. What are two valuable actions for a Scrum Master to take? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Inform the Product Owner's functional manager.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Stop the Sprint, send the Product Owner to a course and restart.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Bring up the problem in the Sprint Retrospective.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Coach the Product Owner in the values of Scrum and incremental delivery.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Nominate a proxy Product Owner.",
                "correct": false
            }
        ]
    },
    {
        "id": 83,
        "content": "True or False: Multiple Scrum Teams working on the same product or system all select work from the same Product Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 84,
        "content": "For the purpose of transparency, when does Scrum say a new Increment of working software must be available?",
        "answers": [
            {
                "id": 1,
                "content": "After the acceptance testing phase.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Before the release Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Every 3 Sprints.",
                "correct": false
            },
            {
                "id": 4,
                "content": "At the end of every Sprint.",
                "correct": true
            },
            {
                "id": 5,
                "content": "When the Product Owner asks to create one.",
                "correct": false
            }
        ]
    },
    {
        "id": 85,
        "content": "True or False: Multiple Scrum Teams working on the same project must have the same Sprint start date.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 86,
        "content": "During a Sprint Retrospective, for what is the Product Owner responsible?",
        "answers": [
            {
                "id": 1,
                "content": "Participating as a Scrum Team member.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Summarizing and reporting the discussions to the stakeholders that he/she represents in the Scrum Team.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Capturing requirements for the Product Backlog.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Product Owner should not take part in Sprint Retrospectives.",
                "correct": false
            }
        ]
    },
    {
        "id": 87,
        "content": "Marian is the Product Owner envisioning a project for a new release of her product. She made a projection of a release date based upon a sustained velocity of 17 completed units of work per Sprint. Over the first 3 Sprints, the average velocity was 13 for work that the Developers estimated as 90% done. The Developers, feeling the need to meet the plan, figured that a velocity of 17 was within their reach. A good way to continue is:",
        "answers": [
            {
                "id": 1,
                "content": "The Developers makes sure that all of the selected scope per Sprint is as \"Done\" as possible. The undone work is estimated and added to the Sprint Backlog of the next Sprint, so it doesn't mess up the Product Backlog.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Add enough people to the Developers for the deadline to be made.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The opportunity to inspect and adapt is lost. Opaqueness has replaced transparency. Predictability has dropped below zero. The produced software is not usable. As the rules of Scrum have not been respected, it is the Scrum Master's duty to assess whether repair is possible, or a restart with a more reliable team. If not, the Scrum Master should cancel the project.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Developers should remind Marian to find funding for enough Release Sprints in which the remaining work can be done.",
                "correct": false
            }
        ]
    },
    {
        "id": 88,
        "content": "The time-box for a Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "Two minutes per person.",
                "correct": false
            },
            {
                "id": 2,
                "content": "15 minutes.",
                "correct": true
            },
            {
                "id": 3,
                "content": "15 minutes for a 4 week sprint. For shorter Sprints it is usually shorter.",
                "correct": false
            },
            {
                "id": 4,
                "content": "4 hours.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The same time of day every day.",
                "correct": false
            }
        ]
    },
    {
        "id": 89,
        "content": "Which phrase best describes a Product Owner?",
        "answers": [
            {
                "id": 1,
                "content": "Go-between Developers and customers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Value optimizer.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Requirements engineer.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Team manager.",
                "correct": false
            }
        ]
    },
    {
        "id": 90,
        "content": "The length of a Sprint should be:",
        "answers": [
            {
                "id": 1,
                "content": "Short enough to keep the business risk acceptable to the Product Owner.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Short enough to be able to synchronize the development work with other business events.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No more than one calendar month.",
                "correct": false
            },
            {
                "id": 4,
                "content": "All of these answers are correct.",
                "correct": true
            }
        ]
    },
    {
        "id": 91,
        "content": "What are two responsibilities of testers in a Scrum Team? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Verifying the work of programmers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Everyone in the Developers is responsible for quality.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Tracking quality metrics.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Finding bugs.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Scrum has no \"tester\" role.",
                "correct": true
            }
        ]
    },
    {
        "id": 92,
        "content": "The CEO asks the Developers to add a \"very important\" item to a Sprint that is in progress. What should the Developers do?",
        "answers": [
            {
                "id": 1,
                "content": "Add the item to the current Sprint and drop an item of equal size.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Add the item to the current Sprint without any adjustments.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Inform the Product Owner so he/she can work with the CEO.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Add the item to the next Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 93,
        "content": "What is the role of management in Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "To facilitate the Scrum Teams with insights and resources that help them improve.",
                "correct": true
            },
            {
                "id": 2,
                "content": "To monitor the Scrum Team's productivity.",
                "correct": false
            },
            {
                "id": 3,
                "content": "To identify and remove people that aren't working hard enough.",
                "correct": false
            },
            {
                "id": 4,
                "content": "To continually monitor staffing levels of the Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 94,
        "content": "Which technique is the best way the Scrum Master can ensure that the Developers communicates effectively with the Product Owner?",
        "answers": [
            {
                "id": 1,
                "content": "Monitor communications between them and facilitate direct collaboration.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Teach the Developers to talk in terms of business needs and objectives.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Teach the Product Owner about the technologies employed during the Sprints.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Act as a go-between for them.",
                "correct": false
            }
        ]
    },
    {
        "id": 95,
        "content": "How much of the Sprint Backlog must be defined during the Sprint Planning event?",
        "answers": [
            {
                "id": 1,
                "content": "Just enough tasks for the Scrum Master to be confident in the Developers understanding of the Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The entire Sprint Backlog must be identified and estimated by the end of the Sprint Planning meeting.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Enough so the Developers can create its best forecast of what is can do, and to start the first several days of the Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Just enough to understand design and architectural implications.",
                "correct": false
            }
        ]
    },
    {
        "id": 96,
        "content": "Who is responsible for managing the progress of work during a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The most junior member of the Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 97,
        "content": "Who is responsible for collaborating with stakeholders?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Team Manager.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Project Manager.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Team.",
                "correct": true
            },
            {
                "id": 5,
                "content": "The Business Analyst.",
                "correct": false
            }
        ]
    },
    {
        "id": 98,
        "content": "What two factors are best considered when establishing the Sprint length? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "The organization has mandated similar length sprints.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The level of uncertainty over the technology to be used.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The frequency at which team formation can be changed.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The risk of being disconnected from the stakeholders.",
                "correct": true
            }
        ]
    },
    {
        "id": 99,
        "content": "Which of these may a Developers deliver at the end of a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "Failing unit tests, to identify acceptance tests for the next Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "An Increment of software with minor known bugs in it.",
                "correct": false
            },
            {
                "id": 3,
                "content": "An Increment of working software that is \"done\".",
                "correct": true
            },
            {
                "id": 4,
                "content": "A single document, if that is what the Scrum Master asked for.",
                "correct": false
            }
        ]
    },
    {
        "id": 100,
        "content": "Who creates a Product Backlog item's estimate?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers after clarifying requirements with the Product Owner.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Product Owner with input from the Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The most senior people in the organization, including architects and subject matter experts.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers, alone.",
                "correct": false
            }
        ]
    },
    {
        "id": 101,
        "content": "Who starts the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "The person coming in last. This encourages people to be on time and helps to stay within the time-box.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Whoever the Developers decides should start.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The person who has the token.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master. This ensures that the Developers have the meeting and stays within the time-box.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The person who last broke the build.",
                "correct": false
            }
        ]
    },
    {
        "id": 102,
        "content": "You are the Scrum Master on a newly formed Scrum Team. Which three of the following activities would probably help the team in starting up? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "Introduce a bonus system for the top performers in the team.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Have the Scrum Team members introduce themselves to each other and give a brief background of their skills and work history.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Have the development managers for each Developer introduce their direct reports and go over their responsibilities on the Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Ensure the Scrum Team members have compatible personalities.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Ensure the team understands they need a Definition of Done.",
                "correct": true
            },
            {
                "id": 6,
                "content": "Ask the Product Owner to discuss the product or project, its history, goals, and context, as well as answer questions.",
                "correct": true
            }
        ]
    },
    {
        "id": 103,
        "content": "The Developers selects a set of Product Backlog items for a Sprint Backlog with the intent to get the selected items \"Done\" by the end of the Sprint. Which three phrases best describe the purpose of a Definition of Done? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "It controls whether the Developers have performed their tasks.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It provides a template for elements that need to be included in the technical documentation.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It creates transparency over the work inspected at the Sprint Review.",
                "correct": true
            },
            {
                "id": 4,
                "content": "It tracks the percent completeness of a Product Backlog item.",
                "correct": false
            },
            {
                "id": 5,
                "content": "It guides the Developers is creating a forecast at the Sprint Planning.",
                "correct": true
            },
            {
                "id": 6,
                "content": "It defines what it takes for an Increment to be ready for release.",
                "correct": true
            }
        ]
    },
    {
        "id": 104,
        "content": "The Daily Scrum is an event that happens every day. What would be three key concerns if the frequency were to be lowered to every two or three days? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "Opportunities to inspect and adapt the Sprint Backlog are lost.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Impediments are raised and resolved more slowly.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Product Owner cannot accurately report progress to the stakeholders.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Too much work is spent updating the Scrum board before the meeting.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Scrum Master loses the ability to update the Gantt chart properly.",
                "correct": false
            },
            {
                "id": 6,
                "content": "The Sprint Backlog may become inaccurate.",
                "correct": true
            }
        ]
    },
    {
        "id": 105,
        "content": "Which statement best describes Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "A defined and predictive process that confirms to the principles of Scientific Management.",
                "correct": false
            },
            {
                "id": 2,
                "content": "A complete methodology that defines how to develop software.",
                "correct": false
            },
            {
                "id": 3,
                "content": "A cookbook that defines best practices for software development.",
                "correct": false
            },
            {
                "id": 4,
                "content": "A framework within which complex products in complex environments are developed.",
                "correct": true
            }
        ]
    },
    {
        "id": 106,
        "content": "Which Scrum Values are exhibited by not building Product Backlog items that have low business value? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "Economic Value Added.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Respect.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Focus.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Earned Value.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Courage.",
                "correct": true
            }
        ]
    },
    {
        "id": 107,
        "content": "How should Product Backlog items be chosen when multiple Scrum Teams work from the same Product Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Team with the highest velocity pulls Product Backlog items first.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers pull in work in agreement with the Product Owner.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Product Owner should provide each team with its own Product Backlog.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Each Scrum Team takes an equal numbers of items.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Product Owner decides.",
                "correct": false
            }
        ]
    },
    {
        "id": 108,
        "content": "How often should Developers change?",
        "answers": [
            {
                "id": 1,
                "content": "As needed, while taking into account a short term reduction in productivity.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Never, because it reduces productivity.",
                "correct": false
            },
            {
                "id": 3,
                "content": "As needed, with no special allowance for changes in productivity.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Every Sprint to promote shared learning.",
                "correct": false
            }
        ]
    },
    {
        "id": 109,
        "content": "Who should make sure everyone on the Developers does his or her tasks for the Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Project Manager.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 5,
                "content": "All of the above.",
                "correct": false
            }
        ]
    },
    {
        "id": 110,
        "content": "When is it most appropriate for a Developers to change the Definition of Done?",
        "answers": [
            {
                "id": 1,
                "content": "During Spring Planning.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Prior to starting a new Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "During the Sprint Retrospective.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Prior to starting a new project.",
                "correct": false
            }
        ]
    },
    {
        "id": 111,
        "content": "As the Sprint Planning meeting progresses, the Developers sees that the workload is greater than they can handle. Which two are valid actions? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Recruit additional Developers before the work can begin.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers ensures that the Product Owner is aware, starts the Sprint, and monitors progress.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Cancel the Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Remove or change selected Product Backlog items.",
                "correct": true
            },
            {
                "id": 5,
                "content": "The Developers works overtime during this Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 112,
        "content": "Currently, your Developers are organized to address a single layer only (for example, front end, middle tier, back end, and interfaces). What are three things to consider when deciding to move away from such component teams toward feature teams? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "You cannot do Scrum without feature teams.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Productivity may suffer when making this kind of move.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Getting support from the business side first helps.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Feature teams have less communication overhead.",
                "correct": true
            },
            {
                "id": 5,
                "content": "With feature teams, it is easier to calculate the productivity per team.",
                "correct": false
            }
        ]
    },
    {
        "id": 113,
        "content": "During a Sprint, when is new work or further decomposition of work added to the Sprint Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "When the Product Owner identifies new work.",
                "correct": false
            },
            {
                "id": 2,
                "content": "As soon as possible after they are identified.",
                "correct": true
            },
            {
                "id": 3,
                "content": "When the Scrum Master has time to enter them.",
                "correct": false
            },
            {
                "id": 4,
                "content": "During the Daily Scrum after the Developers approves them.",
                "correct": false
            }
        ]
    },
    {
        "id": 114,
        "content": "What is the main reason for the Scrum Master to be at the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "To gather status and progress information to report to management.",
                "correct": false
            },
            {
                "id": 2,
                "content": "To write down any changes to the Sprint Backlog, including adding new items, and tracking progress on the burn-down.",
                "correct": false
            },
            {
                "id": 3,
                "content": "He or she does not have to be there; he or she only has to ensure the Developers have a Daily Scrum.",
                "correct": true
            },
            {
                "id": 4,
                "content": "To make sure every team member answers the three questions.",
                "correct": false
            }
        ]
    },
    {
        "id": 115,
        "content": "You have six teams using a traditional method to deliver a product. Your management has asked you to start using Scrum. In the initial project there were separate plans and teams for the layers of a software system, i.e. one for the frontend, one for the middle tier, one for the back-end, and one for the interfaces and services. This resembles what is known as component teams. But you have read that it's a good idea to have teams organized by feature. What are the advantages of keeping component teams while starting Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "There's less initial disruption than organizing into new teams. As they start, they will discover what works best, and how to potentially re-organize towards this.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Component teams generally have the skills needed to create a working Increment of software that provides business value.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Because they have worked together for some time, they are likely able to start producing shippable Increments faster that new feature teams would.",
                "correct": false
            },
            {
                "id": 4,
                "content": "There are fewer cross-team dependencies than working in feature teams.",
                "correct": false
            }
        ]
    },
    {
        "id": 116,
        "content": "True or False: A properly functioning Scrum Team will have at least one Release Sprint and may well have several.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 117,
        "content": "True or False: Scrum is a methodology that tells in detail how to build software incrementally.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 118,
        "content": "For which is the Scrum Master responsible?",
        "answers": [
            {
                "id": 1,
                "content": "Managing the performance of the Scrum Team.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The meetings and the objectives that a Scrum Team sets for itself.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Scrum framework being adopted and used properly.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Keeping track of resource allocation.",
                "correct": false
            }
        ]
    },
    {
        "id": 119,
        "content": "The Developers asks their Product Owner to re-order the Product Backlog. The team is waiting for an external supplier to deliver a specific software component. Without that component there won't be enough work in the next Sprint to occupy the full team. The Product Owner asks the Scrum Master for help. What would be good advice to give the Product Owner?",
        "answers": [
            {
                "id": 1,
                "content": "Remind the Product Owner that his primary concern is the flow of value reflected in the ordering of the Product Backlog.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Tell the Product Owner to re-order the Product Backlog so the work involving the external component can be planned in a separate sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Tell the Product Owner that the Product Backlog should be ordered to maximize utilization of the Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 120,
        "content": "What are three ways Scrum promotes self-management? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "By not allowing documentation.",
                "correct": false
            },
            {
                "id": 2,
                "content": "By the Developers deciding what work to do in a Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "By preventing stakeholders from entering the development room.",
                "correct": false
            },
            {
                "id": 4,
                "content": "By removing titles for Developers.",
                "correct": true
            },
            {
                "id": 5,
                "content": "By being a lightweight framework.",
                "correct": true
            }
        ]
    },
    {
        "id": 121,
        "content": "What is the key concern when multiple Scrum Teams are working from the same Product Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "Minimizing dependencies between teams.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Clear definition of requirements.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Meeting original scope projections.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Making sure there's enough work for everyone on every team.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Maximizing velocity.",
                "correct": false
            }
        ]
    },
    {
        "id": 122,
        "content": "What does it mean to say that an event has a time-box?",
        "answers": [
            {
                "id": 1,
                "content": "The event must happen at a set time.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The event must happen by a given time.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The event must take at least a minimum amount of time.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The event can take no more than a maximum amount of time.",
                "correct": true
            }
        ]
    },
    {
        "id": 123,
        "content": "Which outcome is expected as Scrum Teams mature?",
        "answers": [
            {
                "id": 1,
                "content": "They will improve their Definition of Done to include more stringent criteria.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Sprint Retrospectives will grow to be longer than 4 hours.",
                "correct": false
            },
            {
                "id": 3,
                "content": "There is no need for a time-boxed Sprint, since time-boxes are only for new Scrum Teams.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Sprint Reviews will no longer be needed.",
                "correct": false
            },
            {
                "id": 5,
                "content": "A Scrum Master is no longer needed since they are a mature team now.",
                "correct": false
            }
        ]
    },
    {
        "id": 124,
        "content": "The Product Owner must release each Increment to production.",
        "answers": [
            {
                "id": 1,
                "content": "When it makes sense.",
                "correct": true
            },
            {
                "id": 2,
                "content": "To make sure the Developers are done every Sprint.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Whenever the product is free of defects.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Without exception.",
                "correct": false
            }
        ]
    },
    {
        "id": 125,
        "content": "Who creates the Definition of Done?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master as he/she is responsible for the Developers productivity.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Team, in a collaborative effort where the result is the common denominator of all members' definition.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner as he/she is responsible for the product's success.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The development organization (or Developers if none is available from the development organization).",
                "correct": true
            }
        ]
    },
    {
        "id": 126,
        "content": "Five new Scrum Teams have been created to build one product. A few of the Developers on one of the Scrum Teams ask the Scrum Master how to coordinate their work with the order teams. What should the Scrum Master do?",
        "answers": [
            {
                "id": 1,
                "content": "Teach the Product Owner to work with the lead Developers on ordering Product Backlog in a way to avoid too much technical and development overlap during a Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Teach them that it is their responsibility to work with the other teams to create an integrated Increment.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Collect the Sprint tasks from the teams at the end of their Sprint Planning and merge that into a consolidated plan for the entire Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Visit the five teams each day to inspect that their Sprint Backlogs are aligned.",
                "correct": false
            }
        ]
    },
    {
        "id": 127,
        "content": "Which two things should the Developers do during the first Sprint? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Make up a plan for the rest of the project.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Analyze, describe, and document the requirements for the subsequent Sprints.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Develop at least one piece of functionality.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Analyze, design, and describe the complete architecture and infrastructure.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Create an Increment of potentially releasable software.",
                "correct": true
            }
        ]
    },
    {
        "id": 128,
        "content": "Who determines when it is appropriate to update the Sprint Backlog during a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Project Manager.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Product Owner.",
                "correct": false
            }
        ]
    },
    {
        "id": 129,
        "content": "Who must attend the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master and Product Owner.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Developers and Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Team.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers and Scrum Master.",
                "correct": false
            }
        ]
    },
    {
        "id": 130,
        "content": "When do Developers take ownership of a Sprint Backlog item?",
        "answers": [
            {
                "id": 1,
                "content": "At the Sprint planning meeting.",
                "correct": false
            },
            {
                "id": 2,
                "content": "During the Daily Scrum.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Never. All Sprint Backlog Items are \"owned\" by the entire Scrum Team, even though each one may be done by an individual Developers.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Whenever a team member can accommodate more work.",
                "correct": false
            }
        ]
    },
    {
        "id": 131,
        "content": "True or False: The purpose of a Sprint is to produce a done Increment of product.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 132,
        "content": "In the Sprint Planning meeting, the Product Owner and the Developers were unable to reach a clear understanding about the highest order Product Backlog items. Because of this, the Developers couldn't figure out how many Product Backlog items it could forecast for the upcoming Sprint. They were able to agree on a Sprint Goal, however. Which of the following two actions should the Scrum Master support? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Cancel the Sprint. Send the entire team to an advanced Scrum training and then start a new Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Forecast the most likely Product Backlog items to meet the goal and create a Sprint Backlog based on a likely initial design and plan. Once the time-box for the Sprint Planning meeting is over, start the Sprint and continue to analyze, decompose, and create additional functionality during the Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Continue the Sprint Planning meeting past its time-box until an adequate number of Product Backlog items are well enough understood for the Developers to make a complete forecast. Then start the Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Discuss in the upcoming Sprint Retrospective why this happened and what changes will make it less likely to recur.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Ask everyone to take as much time as needed to analyze the Product Backlog first, and then reconvene another Sprint Planning meeting.",
                "correct": false
            }
        ]
    },
    {
        "id": 133,
        "content": "Which answer best describes the topics covered in Sprint Planning?",
        "answers": [
            {
                "id": 1,
                "content": "What to do and who will do it.",
                "correct": false
            },
            {
                "id": 2,
                "content": "How conditions have changed and how the Product Backlog should evolve.",
                "correct": false
            },
            {
                "id": 3,
                "content": "What can be done and how to do it.",
                "correct": true
            },
            {
                "id": 4,
                "content": "What went wrong in the last Sprint and what to do differently this Sprint.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Who is on the team and what team member roles will be.",
                "correct": false
            }
        ]
    },
    {
        "id": 134,
        "content": "Which of the following is required by Scrum? (choose all that apply)",
        "answers": [
            {
                "id": 1,
                "content": "Sprint Retrospective.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Members must be stand up at the Daily Scrum.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Sprint Burndown Chart.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Release planning.",
                "correct": false
            },
            {
                "id": 5,
                "content": "All of the above.",
                "correct": false
            }
        ]
    },
    {
        "id": 135,
        "content": "What is the purpose of a Sprint Review?",
        "answers": [
            {
                "id": 1,
                "content": "To take time to judge the validity of the project.",
                "correct": false
            },
            {
                "id": 2,
                "content": "To inspect the product Increment with the stakeholders and collect feedback on next steps.",
                "correct": true
            },
            {
                "id": 3,
                "content": "To review the Scrum Team's activities and processes during the Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "To build team sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 136,
        "content": "How should the Developers deal with non-functional requirements?",
        "answers": [
            {
                "id": 1,
                "content": "Ensure every Increment meets them.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Make sure the release department understands these requirements, but it is not the Developers responsibility.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Handle them during the Integration Sprint preceding the Release Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Assign them to the lead Developers on the team.",
                "correct": false
            }
        ]
    },
    {
        "id": 137,
        "content": "When is a Sprint over?",
        "answers": [
            {
                "id": 1,
                "content": "When the Product Owner says it is done.",
                "correct": false
            },
            {
                "id": 2,
                "content": "When all Product Backlog items meet their Definition of Done.",
                "correct": false
            },
            {
                "id": 3,
                "content": "When all the tasks are completed.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When the time-box expires.",
                "correct": true
            }
        ]
    },
    {
        "id": 138,
        "content": "True or False: Scrum has a role called \"Project Manager\".",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 139,
        "content": "Which Scrum Values are violated by building Product Backlog items that have low business value?",
        "answers": [
            {
                "id": 1,
                "content": "Courage.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Focus.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Respect.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Economic Value Added.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Earned Value.",
                "correct": false
            }
        ]
    },
    {
        "id": 140,
        "content": "How much time is required after a Sprint to prepare for the next Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The break between Sprints is time-boxed to 1 week for 30 day Sprints, and usually less for shorter sprints.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Enough time for the requirements for the next Sprint to be determined and documented.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Enough time for the Developers to finish the testing from the last Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "None. A new Sprint starts immediately following the end of the previous Sprint.",
                "correct": true
            },
            {
                "id": 5,
                "content": "All of the above are allowed depending on the situation.",
                "correct": false
            }
        ]
    },
    {
        "id": 141,
        "content": "When many Scrum Teams are working on the same product, should all of their Increments be integrated every Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "Yes, but only for Scrum Teams whose work has dependencies.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Yes, otherwise the Product Owners (and stakeholders) may not be able to accurately inspect what is done.",
                "correct": true
            },
            {
                "id": 3,
                "content": "No, each Scrum Team stands alone.",
                "correct": false
            },
            {
                "id": 4,
                "content": "No, that is far too hard and must be done in a hardening Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 142,
        "content": "When can the Developers cancel a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "It can't. Only Product Owners can cancel Sprints.",
                "correct": true
            },
            {
                "id": 2,
                "content": "When functional expectations are not well understood.",
                "correct": false
            },
            {
                "id": 3,
                "content": "When the Product Owner is absent too often.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When the selected Product Backlog items for the Sprint become unachievable.",
                "correct": false
            },
            {
                "id": 5,
                "content": "When a technical dependency cannot be resolved.",
                "correct": false
            }
        ]
    },
    {
        "id": 143,
        "content": "Which output from Sprint Planning provides the Developers with a target and overarching direction for the Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Sprint Backlog.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Sprint Goal",
                "correct": true
            },
            {
                "id": 3,
                "content": "The release plan.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Sprint Review minutes.",
                "correct": false
            }
        ]
    },
    {
        "id": 144,
        "content": "During the Sprint Retrospective a Scrum Team has identified several high priority process improvements. Which of the following statements is most accurate? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Team may add items to the Sprint Backlog for the next Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Scrum Team should choose at least one high priority process improvement to place in the Product Backlog.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Scrum Team should decline to add a process improvement to the Sprint Backlog when things are running smoothly.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master selects the most important process improvement and places it in the Sprint Backlog.",
                "correct": false
            }
        ]
    },
    {
        "id": 145,
        "content": "What techniques could the Scrum Master use when the Scrum Team gets caught in an internal disagreement about which agile practices to apply? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Involve the complete Scrum Team in making a decision.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Use coaching techniques; such as open questions and active listening.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Ask an external agile coach what they recommend.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Ask team members to take the issue up with to the company's Human Resources department.",
                "correct": false
            }
        ]
    },
    {
        "id": 146,
        "content": "Who is accountable for clearly expressing Product Backlog items? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The business analyst who represents the Product Owner.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Scrum Master, or the Scrum Master may have the Developers do it.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master.",
                "correct": false
            }
        ]
    },
    {
        "id": 147,
        "content": "When many Scrum Teams are working on a single product, what best describes the Definition of Done? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Each Scrum Team defines and uses its own. The differences are discussed and reconciled during a hardening Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Masters from each Scrum Team define a common Definition of Done.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Each Scrum Team uses its own, but must make their definition clear to all other teams so the differences are known.",
                "correct": false
            },
            {
                "id": 4,
                "content": "All Scrum Teams must have a Definition of Done that makes their combined work potentially releasable.",
                "correct": true
            }
        ]
    },
    {
        "id": 148,
        "content": "When many Developers are working on a single product, what best describes the Definition of Done? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "Each Developer defines and uses its own. The differences are discussed and reconciled during a hardening Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It depends.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Each Developer uses its own but must make their definition clear to all other teams so the differences are known.",
                "correct": false
            },
            {
                "id": 4,
                "content": "All Developers must have a Definition of Done that makes their combined work potentially releasable.",
                "correct": true
            }
        ]
    },
    {
        "id": 149,
        "content": "At the seventh Sprint Review, the stakeholders are disappointed and angry. They have determined that the product or system being built will not meet their needs and will cost more than they are willing to spend. What factors likely led to this? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "The Project Management Office (PMO) has not been engaged adequately.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner has not been keeping the stakeholders aware of the progress of the project.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The stakeholders haven't been using the Sprint Reviews to inspect and evaluate progress.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The stakeholders were not allowed to enter the development area.",
                "correct": false
            }
        ]
    },
    {
        "id": 150,
        "content": "When a Scrum Team determines that it will not be able to finish the complete forecast, who has to be present when reviewing and adjusting the Sprint work selected? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner and all stakeholders.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner and the Developers.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Scrum Master, project manager and Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 151,
        "content": "As the Scrum Team starts work during the Sprint, it realizes it has selected too much work to finish in the Sprint. What should it do?",
        "answers": [
            {
                "id": 1,
                "content": "Inform the Product Owner at the Sprint Review, but prior to the demonstration.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Find another Scrum Team to give the excess work to.",
                "correct": false
            },
            {
                "id": 3,
                "content": "As soon as possible in the Sprint, work with the Product Owner to remove some work or Product Backlog items.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Reduce the Definition of Done and get all of the Product Backlog items \"Done\" by the new definition.",
                "correct": false
            }
        ]
    },
    {
        "id": 152,
        "content": "Which of the following are roles on a Scrum Team? (choose all that apply)",
        "answers": [
            {
                "id": 1,
                "content": "Users.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Scrum Master.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Product Owner.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Customers.",
                "correct": false
            }
        ]
    },
    {
        "id": 153,
        "content": "Which two activities will a Product Owner engage in during a Sprint? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Run the Daily Scrum.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Prioritize the Developers work on the Sprint Backlog.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Update management on what is being worked on.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Answer questions from the Developers about items in the current Sprint.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Work with the stakeholders.",
                "correct": true
            }
        ]
    },
    {
        "id": 154,
        "content": "What are two good ways for the Developers to make non-functional requirements visible? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Put them on a separate list on the Scrum board, available for all to see.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Add them to the Product Backlog and keep the Product Owner posted on the expected effort.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Run the integration and regression tests before the end of the Sprint, and capture the open work for the Sprint Backlog of the next Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Add them to the Definition of Done so the work is taken care of every Sprint.",
                "correct": true
            }
        ]
    },
    {
        "id": 155,
        "content": "Which three questions might be answered by Developers at the Daily Scrum? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "How is the Sprint proceeding?",
                "correct": false
            },
            {
                "id": 2,
                "content": "What did I do yesterday that helped the Developers meet the Sprint Goal?",
                "correct": true
            },
            {
                "id": 3,
                "content": "Why were you late?",
                "correct": false
            },
            {
                "id": 4,
                "content": "What will I do today to help the Developers meet the Sprint Goal?",
                "correct": true
            },
            {
                "id": 5,
                "content": "How many hours did I spend on the project yesterday?",
                "correct": false
            },
            {
                "id": 6,
                "content": "What will I be working on tomorrow?",
                "correct": false
            },
            {
                "id": 7,
                "content": "Do I see any impediment that prevents me or the Developers from meeting the Sprint Goal?",
                "correct": true
            }
        ]
    },
    {
        "id": 156,
        "content": "What activities would a Product Owner typically undertake in the phase between the end of the current Sprint and the start of the next Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "There are no such activities. The next Sprint starts immediately after the current Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Refine the Product Backlog.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Work with the Quality Assurance departments on the Increment of the current Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Update the project plan with stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 157,
        "content": "When does a Developer become accountable for the value of a Product Backlog item selected for the Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "During the Daily Scrum",
                "correct": false
            },
            {
                "id": 2,
                "content": "Whenever a team member can accommodate more work.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Never. The entire Scrum Team is accountable for creating value every Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "At the Sprint Planning Event.",
                "correct": false
            }
        ]
    },
    {
        "id": 158,
        "content": "Every Developer should have:",
        "answers": [
            {
                "id": 1,
                "content": "At least one representative from each major software engineering discipline (like QA, Dev, UX).",
                "correct": false
            },
            {
                "id": 2,
                "content": "The competencies and skills needed to deliver a Done Increment in a Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "One Lead Developer and no more than 8 other members.",
                "correct": false
            }
        ]
    },
    {
        "id": 159,
        "content": "Which best describes the Product Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "It is allowed to grow and change as more is learned about the product and its customers.",
                "correct": true
            },
            {
                "id": 2,
                "content": "It provides just enough information to enable a Scrum team to start the design phase of a product.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It contains all foreseeable tasks and requirements from which the Scrum team can develop and maintain a complete project plan.",
                "correct": false
            },
            {
                "id": 4,
                "content": "It is baselined to follow change management processes.",
                "correct": false
            }
        ]
    },
    {
        "id": 160,
        "content": "Who has the final decision about the order of items in the Product Backlog? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Stakeholders.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 161,
        "content": "Which are properties of the Daily Scrum? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "It is facilitated by the team lead.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It is held first thing in the morning.",
                "correct": false
            },
            {
                "id": 3,
                "content": "It is fifteen minutes or less in duration.",
                "correct": true
            },
            {
                "id": 4,
                "content": "It is free from and designed to promote conversation.",
                "correct": false
            },
            {
                "id": 5,
                "content": "It consists of the Scrum Master asking the Team members the three questions.",
                "correct": false
            },
            {
                "id": 6,
                "content": "Its location and time remain constant.",
                "correct": true
            }
        ]
    },
    {
        "id": 162,
        "content": "What is the accountability of the Product Owner during Sprint 0? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "There is no such thing as Sprint 0.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Gathering, eliciting, and analyzing the requirements that will be inserted into the Product Backlog.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Make the complete project plan to commit date, budget, and scope to the stakeholders.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Determine the composition of the Developers so they have the capacity to deliver the completed forecast.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Make sure enough Product Backlog items are refined to fill the first 3 Sprints.",
                "correct": false
            }
        ]
    },
    {
        "id": 163,
        "content": "In accordance with Scrum theory, how should a group of 100 people be divided into multiple Scrum Teams?",
        "answers": [
            {
                "id": 1,
                "content": "Understanding the product, the product vision and the rules of the Scrum framework, the group divides itself into teams.",
                "correct": true
            },
            {
                "id": 2,
                "content": "It doesn't really matter because you can rotate the teams every Sprint to spread knowledge.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Check with the allocation department to see who has worked together before and make these the first teams.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Create a matrix of skills, seniority, and level of experience to assign people to teams.",
                "correct": false
            }
        ]
    },
    {
        "id": 164,
        "content": "Who is accountable for tracking the remaining work toward the Sprint Goal? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Project Manager.",
                "correct": false
            }
        ]
    },
    {
        "id": 165,
        "content": "When must a Product Owner release each Increment? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "When it makes sense.",
                "correct": true
            },
            {
                "id": 2,
                "content": "When the Scrum Team finishes their work.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Whenever the product is free of defects.",
                "correct": false
            },
            {
                "id": 4,
                "content": "After every Sprint, Without exception.",
                "correct": false
            }
        ]
    },
    {
        "id": 166,
        "content": "What are two good ways for a Scrum Team to ensure security concerns are satisfied? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "Postpone the work until a specialist can perform a security audit and create a list of security-related Product Backlog items.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Add security concerns to the Definition of Done.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Add a Sprint to specifically resolve all security concerns.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Delegate the work to the concerned department.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Have the Scrum Team create Product Backlog items for each concern.",
                "correct": true
            }
        ]
    },
    {
        "id": 167,
        "content": "What is the recommended size for a Scrum Team? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "At least 7.",
                "correct": false
            },
            {
                "id": 2,
                "content": "9.",
                "correct": false
            },
            {
                "id": 3,
                "content": "10 or fewer.",
                "correct": true
            },
            {
                "id": 4,
                "content": "7 plus or minus 3.",
                "correct": false
            }
        ]
    },
    {
        "id": 168,
        "content": "How do you know that a Scrum Team is cross-functional?",
        "answers": [
            {
                "id": 1,
                "content": "Scrum Team has all the skills to create a potentially releasable Increment by the end of every Sprint.",
                "correct": true
            },
            {
                "id": 2,
                "content": "A few of the Developers pair program and do Test Driven Development.",
                "correct": false
            },
            {
                "id": 3,
                "content": "There are no conflicts within the Scrum Team.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Every member of the Scrum Team is able to perform every task.",
                "correct": false
            }
        ]
    },
    {
        "id": 169,
        "content": "Select two ways in which technical debt impacts transparency. (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "When calculated and estimated, the total amount of technical debt shows exactly how long until the Product Owner can release the Increment.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It leads to false assumptions about the current state of the system, specifically of an Increment being releasable at the end of a Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "As development progresses and code is added, the system becomes more difficult to stabilize, which results in future work being slowed down in unpredictable ways.",
                "correct": true
            },
            {
                "id": 4,
                "content": "It enhances transparency for the Product Owner as a Developers are not allowed to do additional feature development in a Sprint as long as there is technical debt.",
                "correct": false
            }
        ]
    },
    {
        "id": 170,
        "content": "The Developers are required to deliver a done Increment by the end of a Sprint. Select two statements that explain what \"Done\" means. (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "All work the Developers are willing to do.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Ready for integration.",
                "correct": false
            },
            {
                "id": 3,
                "content": "No work left from the Definition of Done.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Whatever the Product Owner defines as quality.",
                "correct": false
            },
            {
                "id": 5,
                "content": "All work to create software that is ready to be released to end users.",
                "correct": true
            }
        ]
    },
    {
        "id": 171,
        "content": "Which of the following are true about the length of the Sprint? (choose two)",
        "answers": [
            {
                "id": 1,
                "content": "The length of the Sprint should be proportional to the work that is done in between Sprints.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It is best to have Sprints of consistent length throughout a development effort.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Sprint length is determined during Sprint Planning, and should hold the time it will take to code the planned features in the upcoming Sprint, but does not include time for any testing.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Sprint length is determined during Sprint Planning, and should be long enough to make sure the Developers can deliver what is to be accomplished in the upcoming Sprint.",
                "correct": false
            },
            {
                "id": 5,
                "content": "All Sprints must be 1 month or less.",
                "correct": true
            }
        ]
    },
    {
        "id": 172,
        "content": "What may be included in the Sprint Backlog? (choose the best answer)",
        "answers": [
            {
                "id": 1,
                "content": "User Stories.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Tasks.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Use Cases.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Tests.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Any of the above (or others) which are a decomposition of the selected Product Backlog items.",
                "correct": true
            }
        ]
    },
    {
        "id": 173,
        "content": "Developers include which role(s)?",
        "answers": [
            {
                "id": 1,
                "content": "No other roles. Developers is one of the 3 accountabilities in Scrum.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Testers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Business Analysts.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Software Architects.",
                "correct": false
            }
        ]
    },
    {
        "id": 174,
        "content": "The Sprint Backlog must be detailed enough that...",
        "answers": [
            {
                "id": 1,
                "content": "every task is identified when the Sprint Backlog is first created.",
                "correct": false
            },
            {
                "id": 2,
                "content": "changes in progress can be understood in the Daily Scrum.",
                "correct": true
            },
            {
                "id": 3,
                "content": "the Product Owner can understand what everyone is working on.",
                "correct": false
            },
            {
                "id": 4,
                "content": "stakeholders can monitor progress at task level.",
                "correct": false
            }
        ]
    },
    {
        "id": 175,
        "content": "True or False: The Scrum Master is accountable for the Product Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 176,
        "content": "True or False: A Scrum Team uses 2 weeks Sprints and time box their Sprint Planning to 6 hours. Does this break the rules of Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 177,
        "content": "Who is accountable for ensuring that the burn-down chart and gantt chart exist?",
        "answers": [
            {
                "id": 1,
                "content": "No one.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master.",
                "correct": false
            }
        ]
    },
    {
        "id": 178,
        "content": "True or False: By the end of the Sprint Retrospective, the Scrum Team should have identified and planned improvements to increase its effectiveness.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 179,
        "content": "The Scrum Master is a leader and servant in service to which of the following?",
        "answers": [
            {
                "id": 1,
                "content": "The organisation and Scrum Team.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 180,
        "content": "The Product Owner manages...",
        "answers": [
            {
                "id": 1,
                "content": "the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "the Scrum Team.",
                "correct": false
            },
            {
                "id": 3,
                "content": "the Project.",
                "correct": false
            },
            {
                "id": 4,
                "content": "the Product Backlog.",
                "correct": true
            }
        ]
    },
    {
        "id": 181,
        "content": "Management need to monitor progress on a daily basis and decide to do so by attending the Daily Scrum. What are the likely results? (choose three)",
        "answers": [
            {
                "id": 1,
                "content": "Management will be able to better direct the work of the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Additional facilitation may be required to keep to the time-box.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Developers may end up with less time in the Daily Scrum to re-plan their work.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Developers may be less open and transparent during the Daily Scrum.",
                "correct": true
            }
        ]
    },
    {
        "id": 182,
        "content": "True or False: The Product Owner must attend the Sprint Retrospective.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 183,
        "content": "True or False: A Scrum Team must only work on a single Product Goal at any time.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 184,
        "content": "True or False: The Definition of Done is a mandatory part of Scrum.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 185,
        "content": "True or False: The Scrum Master must facilitate the Daily Scrum.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 186,
        "content": "Among the Developers, there is nobody with significant testing expertise. They should...",
        "answers": [
            {
                "id": 1,
                "content": "request for a specialist tester to join them and queue testing for them to do when they arrive in a later Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "produce an Increment that will be tested by a dedicated test team after the Sprint to guarantee the quality.",
                "correct": false
            },
            {
                "id": 3,
                "content": "raise this as an impediment which may require the assistance of the Scrum Master to resolve.",
                "correct": true
            },
            {
                "id": 4,
                "content": "quality is the responsibility of the Developers and they should undertake testing themselves to the best of their abilities.",
                "correct": true
            }
        ]
    },
    {
        "id": 187,
        "content": "True or False: The Sprint Planning event is comprised of 2 parts and the Product Owner is not needed at the 2nd part.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 188,
        "content": "Product Backlog refinement is...",
        "answers": [
            {
                "id": 1,
                "content": "carried out once per Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "a Scrum event.",
                "correct": false
            },
            {
                "id": 3,
                "content": "the concern of the Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "an ongoing process in which the Product Owner and the Developers collaborate.",
                "correct": true
            }
        ]
    },
    {
        "id": 189,
        "content": "An Increment is...",
        "answers": [
            {
                "id": 1,
                "content": "all work that has happened up to the current point in time.",
                "correct": false
            },
            {
                "id": 2,
                "content": "all work completed up to now, where there are no bugs present.",
                "correct": false
            },
            {
                "id": 3,
                "content": "all work that was carried out in the Sprint.",
                "correct": false
            },
            {
                "id": 4,
                "content": "the sum of the Done work during a Sprint, plus the work Done in earlier Sprints.",
                "correct": true
            }
        ]
    },
    {
        "id": 190,
        "content": "Which statement best describes a cross-functional team?",
        "answers": [
            {
                "id": 1,
                "content": "The team has all competencies needed to accomplish the work.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The team has a good mix of skills.",
                "correct": false
            },
            {
                "id": 3,
                "content": "All members of the team have all the skills required to create the Product.",
                "correct": false
            }
        ]
    },
    {
        "id": 191,
        "content": "The result of the Sprint Review is...",
        "answers": [
            {
                "id": 1,
                "content": "incomplete Product Backlog Items have been reviewed and returned to the top of the Product Backlog.",
                "correct": false
            },
            {
                "id": 2,
                "content": "the Increment has been demonstrated to Stakeholders.",
                "correct": false
            },
            {
                "id": 3,
                "content": "a revised Product Backlog that defines the probable Product Backlog items for the next Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "acceptance (or rejection) of all Product Backlog Items.",
                "correct": false
            }
        ]
    },
    {
        "id": 192,
        "content": "The Product Owner is using burn-up charts instead of burn-down charts. What would your response be as Scrum Master?",
        "answers": [
            {
                "id": 1,
                "content": "There's nothing wrong with it.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Burn-up charts are used in traditional methods and should be replaced by burn-down charts.",
                "correct": false
            }
        ]
    },
    {
        "id": 193,
        "content": "True or False: The Scrum Master manages the Scrum Team.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 194,
        "content": "The Scrum Master is responsible for?",
        "answers": [
            {
                "id": 1,
                "content": "Delivering the Product on budget and to the agreed schedule.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Ensuring Scrum is understood.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Solving all impediments, blockers & issues.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Coordinating the work of the Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 195,
        "content": "A Scrum Team has how many specific accountabilities?",
        "answers": [
            {
                "id": 1,
                "content": "1.",
                "correct": false
            },
            {
                "id": 2,
                "content": "4.",
                "correct": false
            },
            {
                "id": 3,
                "content": "2.",
                "correct": false
            },
            {
                "id": 4,
                "content": "3.",
                "correct": true
            }
        ]
    },
    {
        "id": 196,
        "content": "Who is responsible for monitoring the progress of work during a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "Project Manager.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Product Owner.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Scrum Master.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Developers.",
                "correct": true
            }
        ]
    },
    {
        "id": 197,
        "content": "True or False: During Sprint Planning, every task must be estimated so the Developers can be sure they have the capacity to complete them in the Sprint.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 198,
        "content": "Who may be best positioned to decide who will be the Scrum Master for a new Scrum Team?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers and the Product Owner.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 199,
        "content": "The Daily Scrum is consistently taking longer than 15 minutes. Which statement best describes what should be done?",
        "answers": [
            {
                "id": 1,
                "content": "A 2nd Daily Scrum should be held at the end of the day.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Master should help the Developers understand why the 15 minute time-box should be respected and help them find ways to do it as required.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Developers should leave at the end of the 15 minutes.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Developers should take the additional time that they need in the Daily Scrum.",
                "correct": false
            }
        ]
    },
    {
        "id": 200,
        "content": "True or False: A Scrum Team must be 10 or fewer people.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 201,
        "content": "True or False: A Scrum Team must never have any technical debt.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 202,
        "content": "True or False: During Sprint Planning, all Product Backlog Items must be decomposed to a definitive set of tasks for the Developers to complete.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 203,
        "content": "True or False: The Increment must be released at the end of every Sprint.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 204,
        "content": "True or False: Developers should be set stretch goals by the Product Owner as part of Sprint Planning.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 205,
        "content": "True or False: During the Daily Scrum, the Developers must answer the \"3 questions\".",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 206,
        "content": "Select the correct timebox for each Scrum event.",
        "answers": [
            {
                "id": 1,
                "content": "Sprint Planning - 8 hours, Daily Scrum - 30 minutes, Sprint Review - 4 hours, Sprint Retrospective - 3 hours.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Sprint Planning - 4 hours, Daily Scrum - 15 minutes, Sprint Review - 4 hours, Sprint Retrospective - 4 hours.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Sprint Planning - 4 hours, Daily Scrum - 15 minutes, Sprint Review - 8 hours, Sprint Retrospective - 4 hours.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Sprint Planning - 8 hours, Daily Scrum - 15 minutes, Sprint Review - 4 hours, Sprint Retrospective - 3 hours.",
                "correct": true
            }
        ]
    },
    {
        "id": 207,
        "content": "True or False: The Scrum Master can be removed once Scrum is adopted.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 208,
        "content": "Who can do the work to ensure the Product Backlog is refined to a state that it is useful?",
        "answers": [
            {
                "id": 1,
                "content": "The Business Analyst.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Stakeholders.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers, with support from the Product Owner who is still accountable for it.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Product Owner.",
                "correct": true
            }
        ]
    },
    {
        "id": 209,
        "content": "The purpose of the Sprint Review is...",
        "answers": [
            {
                "id": 1,
                "content": "to show Stakeholders work that is done and work that is near to completion.",
                "correct": false
            },
            {
                "id": 2,
                "content": "to inspect the outcome of the Sprint and determine future adaptations.",
                "correct": true
            },
            {
                "id": 3,
                "content": "to review the status of the Project.",
                "correct": false
            },
            {
                "id": 4,
                "content": "to check what was done and not done during the Sprint.",
                "correct": false
            }
        ]
    },
    {
        "id": 210,
        "content": "Who can change the Sprint Backlog during a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Stakeholders.",
                "correct": false
            }
        ]
    },
    {
        "id": 211,
        "content": "True or False: Before the first Sprint, the Product Backlog must contain everything we will develop for the product.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 212,
        "content": "A Product Backlog is never complete.",
        "answers": [
            {
                "id": 1,
                "content": "False - A complete Product Backlog should be created before starting the first Sprint.",
                "correct": false
            },
            {
                "id": 2,
                "content": "True - As long as a product exists, its Product Backlog also exists.",
                "correct": true
            }
        ]
    },
    {
        "id": 213,
        "content": "What does the Sprint burn-down chart show?",
        "answers": [
            {
                "id": 1,
                "content": "The evolution of the amount of uncertainty during a project.",
                "correct": false
            },
            {
                "id": 2,
                "content": "An overview of the release progress by plotting the remaining workload.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Dependencies, start times and stop times for project tasks3.",
                "correct": false
            },
            {
                "id": 4,
                "content": "How much work remains until the end of the Sprint.",
                "correct": true
            }
        ]
    },
    {
        "id": 214,
        "content": "A new Developer joins the Scrum Team taking the total number to 11 people. As a Scrum Master, What should you do?",
        "answers": [
            {
                "id": 1,
                "content": "Instruct the Developers to split into 2 teams.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Do nothing, the Developers must fix its own issues.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Instruct the Developers to split into 2 teams, they should decide the appropriate sizes.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Raise the increased team size as a potential issue and help the Developers decide what to do about it.",
                "correct": true
            }
        ]
    },
    {
        "id": 215,
        "content": "Which technique is the best way the Scrum Master can ensure that the Developers communicate effectively with the Product Owner?",
        "answers": [
            {
                "id": 1,
                "content": "Teach the Developers to talk in terms of business needs and objectives.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Observe communications between them and facilitate direct collaboration.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Function as a go-between for them.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Teach the Product Owner about the technologies employed during the Sprints.",
                "correct": false
            }
        ]
    },
    {
        "id": 216,
        "content": "Which two things should the Scrum Team do during the first Sprint? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "Develop and deliver at least one piece of functionality.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Deliver an Increment of useful and valuable product",
                "correct": true
            },
            {
                "id": 3,
                "content": "Determine the complete architecture and infrastructure for the product.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Create the complete Product Backlog to be developed in subsequent Sprints.",
                "correct": false
            }
        ]
    },
    {
        "id": 217,
        "content": "Who is on the Scrum Team?(choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Project Manager.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Developers.",
                "correct": true
            }
        ]
    },
    {
        "id": 218,
        "content": "The timebox for a Daily Scrum is?",
        "answers": [
            {
                "id": 1,
                "content": "15 minutes.",
                "correct": true
            },
            {
                "id": 2,
                "content": "15 minutes for a 4-week sprint. For shorter Sprints it is usually shorter.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Two minutes per person.",
                "correct": false
            },
            {
                "id": 4,
                "content": "4 hours.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The same time of day every day.",
                "correct": false
            }
        ]
    },
    {
        "id": 219,
        "content": "The three pillars of empiricism are:",
        "answers": [
            {
                "id": 1,
                "content": "Respect For People, Kaizen, Eliminating Waste.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Planning, Inspection, Adaptation",
                "correct": false
            },
            {
                "id": 3,
                "content": "Planning, Demonstration, Retrospective",
                "correct": false
            },
            {
                "id": 4,
                "content": "Inspection, Transparency, Adaptation",
                "correct": true
            },
            {
                "id": 5,
                "content": "Transparency, Eliminating Waste, Kaizen.",
                "correct": false
            }
        ]
    },
    {
        "id": 220,
        "content": "What does it mean to say that an event has a timebox?",
        "answers": [
            {
                "id": 1,
                "content": "The event must happen by a given time.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The event must happen at a set time.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The event must take at least a minimum amount of time",
                "correct": false
            },
            {
                "id": 4,
                "content": "The event can take no more than a maximum amount of time.",
                "correct": true
            }
        ]
    },
    {
        "id": 221,
        "content": "Upon what type of process control is Scrum based?",
        "answers": [
            {
                "id": 1,
                "content": "Hybrid.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Empirical.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Defined.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Complex.",
                "correct": false
            }
        ]
    },
    {
        "id": 222,
        "content": "True or False: It is mandatory that the product Increment be released to production at the end of each Sprint.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 223,
        "content": "The timebox for the Sprint Review is:",
        "answers": [
            {
                "id": 1,
                "content": "2 hours.",
                "correct": false
            },
            {
                "id": 2,
                "content": "1 day.",
                "correct": false
            },
            {
                "id": 3,
                "content": "4 hours for a monthly Sprint. For shorter Sprints it is usually shorter.",
                "correct": true
            },
            {
                "id": 4,
                "content": "4 hours and longer as needed.",
                "correct": false
            },
            {
                "id": 5,
                "content": "As long as needed.",
                "correct": false
            }
        ]
    },
    {
        "id": 224,
        "content": "Which statement best describes a Product Owner's responsibility?",
        "answers": [
            {
                "id": 1,
                "content": "Keep stakeholders from distracting the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Optimizing the value of the work the Scrum Team does.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Managing the project and ensuring that the work meets the commitments to the stakeholders.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Directing the Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 225,
        "content": "Why is the Daily Scrum held at the same time and same place?",
        "answers": [
            {
                "id": 1,
                "content": "The place can be named.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Rooms are hard to book and this lets it be booked in advance.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The consistency reduces complexity.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Product Owner demands it.",
                "correct": false
            }
        ]
    },
    {
        "id": 226,
        "content": "A Scrum Team consists of the following:(choose the best three answers)",
        "answers": [
            {
                "id": 1,
                "content": "Users.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Product Owner.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Customers.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Developers.",
                "correct": true
            },
            {
                "id": 5,
                "content": "Scrum Master.",
                "correct": true
            }
        ]
    },
    {
        "id": 227,
        "content": "True or False: The purpose of a Sprint is to produce a valuable and useful Increment of working product.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": true
            },
            {
                "id": 2,
                "content": "False.",
                "correct": false
            }
        ]
    },
    {
        "id": 228,
        "content": "The timebox for the Sprint Planning event is?",
        "answers": [
            {
                "id": 1,
                "content": "4 hours.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Monthly.",
                "correct": false
            },
            {
                "id": 3,
                "content": "8 hours for a monthly Sprint. For shorter Sprints it is usually shorter.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Whenever itis done.",
                "correct": false
            }
        ]
    },
    {
        "id": 229,
        "content": "What is the main reason for the Scrum Master to be at the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "To gather status and progress information to report to management",
                "correct": false
            },
            {
                "id": 2,
                "content": "To write down any changes to the Sprint Backlog, including adding new items, and tracking progress on the burn-down.",
                "correct": false
            },
            {
                "id": 3,
                "content": "They do not have to be there; they only need to ensure the Developers have a Daily Scrum",
                "correct": true
            },
            {
                "id": 4,
                "content": "To make sure every team member answers the three questions",
                "correct": false
            }
        ]
    },
    {
        "id": 230,
        "content": "What is the function or purpose of Management in Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "Identify and remove people that are not working hard enough",
                "correct": false
            },
            {
                "id": 2,
                "content": "Monitor the progress of the Developers on the Scrum Team",
                "correct": false
            },
            {
                "id": 3,
                "content": "Support the Product Owner with insights and information into high value product and system capabilities. Support the Scrum Master to encourage organizational change that fosters empiricism, self-management, bottom-up intelligence, and intelligent product delivery.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Continually monitor staffing levels of the Scrum Team.",
                "correct": false
            }
        ]
    },
    {
        "id": 231,
        "content": "When does a Developer become the sole owner of an item on the Sprint Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "Whenever a team member can accommodate more work.",
                "correct": false
            },
            {
                "id": 2,
                "content": "At the Sprint Planning event",
                "correct": false
            },
            {
                "id": 3,
                "content": "Never. All Sprint Backlog items are \"owned\" by the Developers on the Scrum Team.",
                "correct": true
            },
            {
                "id": 4,
                "content": "During the Daily Scrum",
                "correct": false
            }
        ]
    },
    {
        "id": 232,
        "content": "What is the typical size for a Scrum Team?",
        "answers": [
            {
                "id": 1,
                "content": "10 or fewer.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Minimum of 7.",
                "correct": false
            },
            {
                "id": 3,
                "content": "7 plus or minus",
                "correct": false
            },
            {
                "id": 4,
                "content": "9",
                "correct": false
            }
        ]
    },
    {
        "id": 233,
        "content": "An organization has decided to adopt Scrum, but management wants to change the terminology to fit with terminology already used. What will likely happen if this is done?",
        "answers": [
            {
                "id": 1,
                "content": "Without a new vocabulary as a reminder of the change, very little change may actually happen",
                "correct": false
            },
            {
                "id": 2,
                "content": "The organization may not understand what has changed with Scrum and the benefits of Scrum may be lost",
                "correct": false
            },
            {
                "id": 3,
                "content": "Management may feel less anxious",
                "correct": false
            },
            {
                "id": 4,
                "content": "Al of the above",
                "correct": true
            }
        ]
    },
    {
        "id": 234,
        "content": "Which of the following are examples of a Scrum Team practicing Scrum poorly or not exhibiting traits of a self-managing Scrum Team?",
        "answers": [
            {
                "id": 1,
                "content": "The Developers have all the skills they need to create a valuable, useful Increment",
                "correct": false
            },
            {
                "id": 2,
                "content": "StakeNolders attend the Daily Scrum to check on the Scrum Team's progress.",
                "correct": true
            },
            {
                "id": 3,
                "content": "The Developers create their own Sprint Backlog, reflecting all work that i required to meet the Definition of Done.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Developers are collaboratively selecting their own work during the Sprint",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Developers invite external stakeholders to the Sprint Planning tosk them how to turn a Product Backlog item into an Increment via a complete and detailed Sprint Backlog",
                "correct": true
            },
            {
                "id": 6,
                "content": "The Developers are working within the boundaries of their organizations functional description and nicely handing off work from analyst to Developer to tester to integration",
                "correct": true
            }
        ]
    },
    {
        "id": 235,
        "content": "Who is required to attend the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "The Scrum Master and Product Owner.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers and Scrum Master.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Developers and Product Owner.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Scrum Team",
                "correct": false
            }
        ]
    },
    {
        "id": 236,
        "content": "How much work must the Developers complete for each Product Backlog item they select for a Sprint?",
        "answers": [
            {
                "id": 1,
                "content": "All development work and at least some testing",
                "correct": false
            },
            {
                "id": 2,
                "content": "Enough so that each Product Backlog item they select meets the Definition of Done.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Analysis, design, programming, testing and documentation",
                "correct": false
            },
            {
                "id": 4,
                "content": "As much as it can fit into the Sprint",
                "correct": false
            }
        ]
    },
    {
        "id": 237,
        "content": "During a Sprint, a Developer determines that the Scrum Team will not be able to complete the items in their forecast. Who should be present to review and adjust the Product Backlog items selected?",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner and all stakeholders",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Scrum Master, the project manager, and the Developers",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Product Owner and the Developers.",
                "correct": true
            },
            {
                "id": 4,
                "content": "The Developers.",
                "correct": false
            }
        ]
    },
    {
        "id": 238,
        "content": "Who has the final say on the order of the Product Backlog?",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner.",
                "correct": true
            },
            {
                "id": 2,
                "content": "The CEO.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers.",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master.",
                "correct": false
            },
            {
                "id": 5,
                "content": "The Stakeholders",
                "correct": false
            }
        ]
    },
    {
        "id": 239,
        "content": "Who should know the most about the progress toward a business objective or a release, and be able to explain the alternatives most clearly?",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner",
                "correct": true
            },
            {
                "id": 2,
                "content": "The Project Manager",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Developers",
                "correct": false
            },
            {
                "id": 4,
                "content": "The Scrum Master",
                "correct": false
            }
        ]
    },
    {
        "id": 240,
        "content": "Which of the following services is appropriate for a Scrum Master in regard to the Daily Scrum?",
        "answers": [
            {
                "id": 1,
                "content": "Teach the Developers to keep the Daily Scrum within the 15 minute timebox.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Lead the discussions of the Developers.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Facilitate in a way that ensures each team member has a chance to speak",
                "correct": false
            },
            {
                "id": 4,
                "content": "All answers apply.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Ensure that all 3 questions have been answered",
                "correct": false
            }
        ]
    },
    {
        "id": 241,
        "content": "The Developers should not be interrupted during the Sprint and the Sprint Goal should remain intact. These are conditions that foster creativity, quality and productivity. Which one of the following answers is FALSE?",
        "answers": [
            {
                "id": 1,
                "content": "The Product Owner can help clarify or optimize the Sprint when asked by the Developers.",
                "correct": false
            },
            {
                "id": 2,
                "content": "The Developers may work with the Product Owner to add or remove work if they find themselves with more or less capacity than expected.",
                "correct": false
            },
            {
                "id": 3,
                "content": "The Sprint Backlog is fully formulated in the Sprint Planning event and does not change during the Sprint.",
                "correct": true
            },
            {
                "id": 4,
                "content": "As a decomposition of the selected Product Backlog items, the Sprint Backlog changes and may grow as the work emerges.",
                "correct": false
            }
        ]
    },
    {
        "id": 242,
        "content": "When does the next Sprint begin?",
        "answers": [
            {
                "id": 1,
                "content": "Next Monday.",
                "correct": false
            },
            {
                "id": 2,
                "content": "Immediately after the conclusion of the previous Sprint.",
                "correct": true
            },
            {
                "id": 3,
                "content": "Immediately following the next Sprint Planning.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When the Product Owner is ready.",
                "correct": false
            }
        ]
    },
    {
        "id": 243,
        "content": "What are two ways a Scrum Master serves to enable effective Scrum Teams?",
        "answers": [
            {
                "id": 1,
                "content": "By facilitating Developer decision-making.",
                "correct": true
            },
            {
                "id": 2,
                "content": "By keeping high value features high in the Product Backlog",
                "correct": false
            },
            {
                "id": 3,
                "content": "By removing impediments that hinder the Scrum Team.",
                "correct": true
            },
            {
                "id": 4,
                "content": "By starting and ending the meetings at the proper time.",
                "correct": false
            }
        ]
    },
    {
        "id": 244,
        "content": "True or False: When multiple Scrum Teams work together on the same product, each team should maintain a separate Product Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 245,
        "content": "When should a Developer on a Scrum Team be replaced?",
        "answers": [
            {
                "id": 1,
                "content": "As needed, while taking into account a short-term reduction in productivity.",
                "correct": true
            },
            {
                "id": 2,
                "content": "Every Sprint to promote shared learning",
                "correct": false
            },
            {
                "id": 3,
                "content": "As needed, with no special allowance for changes in productivity.",
                "correct": false
            },
            {
                "id": 4,
                "content": "Never, it reduces productivity.",
                "correct": false
            }
        ]
    },
    {
        "id": 246,
        "content": "Which are characteristics of the Daily Scrum? (choose the best two answers)",
        "answers": [
            {
                "id": 1,
                "content": "It is facilitated by the team lead.",
                "correct": false
            },
            {
                "id": 2,
                "content": "It consists of the Scrum Master asking the team for status.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Its purpose is to inspect progress toward the Sprint Goal and adapt the Sprint Backlog.",
                "correct": true
            },
            {
                "id": 4,
                "content": "Is is held first thing in the morning.",
                "correct": false
            },
            {
                "id": 5,
                "content": "Its location and time remain constant.",
                "correct": true
            }
        ]
    },
    {
        "id": 247,
        "content": "True or False: The Scrum Team must choose at least one high priority process improvement item, identified during the Sprint Retrospective, and place it in the Sprint Backlog.",
        "answers": [
            {
                "id": 1,
                "content": "True.",
                "correct": false
            },
            {
                "id": 2,
                "content": "False.",
                "correct": true
            }
        ]
    },
    {
        "id": 248,
        "content": "When does a Sprint conclude?",
        "answers": [
            {
                "id": 1,
                "content": "When the Product Owner decides enough has been delivered to meet the Sprint Goal.",
                "correct": false
            },
            {
                "id": 2,
                "content": "When the Sprint Retrospective is complete.",
                "correct": true
            },
            {
                "id": 3,
                "content": "When all the tasks are completed by the Developers.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When all Product Backlog items meet their Definition of Done.",
                "correct": false
            }
        ]
    },
    {
        "id": 249,
        "content": "When must a Scrum Team release each Increment?",
        "answers": [
            {
                "id": 1,
                "content": "When the Scrum Team finishes their work.",
                "correct": false
            },
            {
                "id": 2,
                "content": "After every Sprint, without exception.",
                "correct": false
            },
            {
                "id": 3,
                "content": "Whenever the product is free of defects.",
                "correct": false
            },
            {
                "id": 4,
                "content": "When it makes sense to release it.",
                "correct": true
            }
        ]
    },
    {
        "id": 250,
        "content": "Which of the following is an example of an Increment?",
        "answers": [
            {
                "id": 1,
                "content": "A plan for the overall product release.",
                "correct": false
            },
            {
                "id": 2,
                "content": "A mock-up of the product marketing materials.",
                "correct": false
            },
            {
                "id": 3,
                "content": "A design for the product.",
                "correct": false
            },
            {
                "id": 4,
                "content": "A product roll-out plan.",
                "correct": false
            },
            {
                "id": 5,
                "content": "A valuable, useful set of product features.",
                "correct": true
            },
            {
                "id": 6,
                "content": "All of the above.",
                "correct": false
            }
        ]
    }
]